/*
#############################################################################################
# Global Agenda (1.5.1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function TgClient.TgAgencyData.GetDefaultRankData
// [0x00820802] ( FUNC_Event )
struct UTgAgencyData_eventGetDefaultRankData_Parms
{
	struct FsAgencyRankData                            ReturnValue;                                      		// 0x0000 (0x0018) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FsAgencyRankData                         sInfo;                                            		// 0x0018 (0x0018) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.GetDefaultMemberInfo
// [0x00820802] ( FUNC_Event )
struct UTgAgencyData_eventGetDefaultMemberInfo_Parms
{
	struct FsAgencyMemberInfo                          ReturnValue;                                      		// 0x0000 (0x004C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FsAgencyMemberInfo                       sInfo;                                            		// 0x004C (0x004C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.Tick
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.SetTax
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetTax_Parms
{
	float                                              fTax;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.SetDescription
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetDescription_Parms
{
	struct FString                                     sDescription;                                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.SetOfficerComment
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetOfficerComment_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sNote;                                            		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.SetPublicComment
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetPublicComment_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sNote;                                            		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.SetMOTD
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetMOTD_Parms
{
	struct FString                                     sMOTD;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.TransferLeader
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execTransferLeader_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.Disband
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execDisband_Parms
{
};

// Function TgClient.TgAgencyData.Create
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execCreate_Parms
{
	struct FString                                     sAgencyName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FLinearColor                                AgencyColor;                                      		// 0x000C (0x0010) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.Invite
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execInvite_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.Remove
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execRemove_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.Demote
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execDemote_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.Promote
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execPromote_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.UpdateRecruiting
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execUpdateRecruiting_Parms
{
	struct FString                                     sText;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bRecruiting : 1;                                  		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bSubOnly : 1;                                     		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgAgencyData.CheckFiltered
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execCheckFiltered_Parms
{
	struct FsAgencyMemberInfo                          Info;                                             		// 0x0000 (0x004C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nFilter;                                          		// 0x004C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0050 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgAgencyData.SetFilter
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execSetFilter_Parms
{
	int                                                nNewFilter;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.GetNumMembersOfRank
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetNumMembersOfRank_Parms
{
	int                                                nRankId;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgAgencyData.LocalPlayerHasPermission
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execLocalPlayerHasPermission_Parms
{
	int                                                flag;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgAgencyData.LocalPlayerIsLeader
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execLocalPlayerIsLeader_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgAgencyData.GetLocalPlayerInfo
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetLocalPlayerInfo_Parms
{
	struct FsAgencyMemberInfo                          ReturnValue;                                      		// 0x0000 (0x004C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.GetMemberInfo
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetMemberInfo_Parms
{
	int                                                nPlayerId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FsAgencyMemberInfo                          ReturnValue;                                      		// 0x0004 (0x004C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.GetLocalRankData
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetLocalRankData_Parms
{
	struct FsAgencyRankData                            ReturnValue;                                      		// 0x0000 (0x0018) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.GetRankData
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetRankData_Parms
{
	int                                                nRank;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FsAgencyRankData                            ReturnValue;                                      		// 0x0004 (0x0018) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.ClearData
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execClearData_Parms
{
	int                                                rosterflags;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAgencyData.RequestAgencyInfo
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execRequestAgencyInfo_Parms
{
	int                                                Flags;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgAgencyData.GetSortedInfoArray
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execGetSortedInfoArray_Parms
{
	TArray< struct FsAgencyMemberInfo >                ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAgencyData.InitAgencyData
// [0x00020400] ( FUNC_Native )
struct UTgAgencyData_execInitAgencyData_Parms
{
};

// Function TgClient.TgAllianceData.GetDefaultMemberInfo
// [0x00820802] ( FUNC_Event )
struct UTgAllianceData_eventGetDefaultMemberInfo_Parms
{
	struct FsAllianceMemberInfo                        ReturnValue;                                      		// 0x0000 (0x0024) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FsAllianceMemberInfo                     sInfo;                                            		// 0x0024 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function TgClient.TgAllianceData.Disband
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execDisband_Parms
{
};

// Function TgClient.TgAllianceData.Remove
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execRemove_Parms
{
	int                                                nAgencyId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAllianceData.Invite
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execInvite_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAllianceData.Create
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execCreate_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgAllianceData.GetMemberInfo
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execGetMemberInfo_Parms
{
	int                                                nAgencyId;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FsAllianceMemberInfo                        ReturnValue;                                      		// 0x0004 (0x0024) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgAllianceData.Tick
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execTick_Parms
{
	float                                              DeltaSeconds;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgAllianceData.ClearData
// [0x00024400] ( FUNC_Native )
struct UTgAllianceData_execClearData_Parms
{
	unsigned long                                      bGeneralData : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bMemberData : 1;                                  		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgAllianceData.RequestAllianceInfo
// [0x00020400] ( FUNC_Native )
struct UTgAllianceData_execRequestAllianceInfo_Parms
{
	int                                                Flags;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgConsole.InputKey
// [0x00024002] 
struct UTgConsole_execInputKey_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       Key;                                              		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Event;                                            		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              AmountDepressed;                                  		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bGamepad : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgConsole.SetEnabled
// [0x00020400] ( FUNC_Native )
struct UTgConsole_execSetEnabled_Parms
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgDataInterface.GetLocalBotList
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execGetLocalBotList_Parms
{
	class UTgDataSet*                                  pDataSet;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataInterface.GetInstanceList
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execGetInstanceList_Parms
{
	class UTgDataSet*                                  pDataSet;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataInterface.QueryPlayers
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execQueryPlayers_Parms
{
	class UTgDataSet*                                  pDataSet;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataInterface.GetCharacterStats
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execGetCharacterStats_Parms
{
	class UTgDataSet*                                  pDataSet;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataInterface.GetLootTableItems
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execGetLootTableItems_Parms
{
	int                                                nLootTableId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nProfileId;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UTgDataSet*                                  pDataSet;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataInterface.AddCharacter
// [0x00020400] ( FUNC_Native )
struct UTgDataInterface_execAddCharacter_Parms
{
	struct FCharacterInfoStruct                        CharInfo;                                         		// 0x0000 (0x0038) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UTgDataSet*                                  pDataSet;                                         		// 0x0038 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataSet.MakeRequest
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execMakeRequest_Parms
{
	struct FString                                     sFuncName;                                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.UpdateParam
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execUpdateParam_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sValue;                                           		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.AddParam
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execAddParam_Parms
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sValue;                                           		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.CallRegisteredForEvents
// [0x00020400] ( FUNC_Native )
struct UTgDataSet_execCallRegisteredForEvents_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataSet.RegisterForEvents
// [0x00020400] ( FUNC_Native )
struct UTgDataSet_execRegisterForEvents_Parms
{
	class UObject*                                     pObject;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       nmFuncName;                                       		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataSet.GetErrorText
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetErrorText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetErrorColumn
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetErrorColumn_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetErrorCode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetErrorCode_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.AddCurrentRow
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execAddCurrentRow_Parms
{
	class UTgDataSet*                                  pDataSet;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataSet.Sort
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execSort_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bAscending : 1;                                   		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgDataSet.DeleteAll
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execDeleteAll_Parms
{
	unsigned long                                      bUpdateBound : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgDataSet.DeleteRow
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execDeleteRow_Parms
{
};

// Function TgClient.TgDataSet.AddRow
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execAddRow_Parms
{
};

// Function TgClient.TgDataSet.GoToRowSet
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGoToRowSet_Parms
{
	int                                                nTokenId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.MoveTo
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execMoveTo_Parms
{
	int                                                nRowNumber;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.MoveLast
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execMoveLast_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.MoveNext
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execMoveNext_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.MoveFirst
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execMoveFirst_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.SetNbrColValue
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execSetNbrColValue_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              fValue;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgDataSet.SetStrColValue
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execSetStrColValue_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sValue;                                           		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetNbrColValue
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetNbrColValue_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.GetStrColValueByRow
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetStrColValueByRow_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                iRowId;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetStrColValue
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetStrColValue_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetStrColText
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetStrColText_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TgClient.TgDataSet.GetCurrentRowId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execGetCurrentRowId_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.ColumnEmptyOrNull
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execColumnEmptyOrNull_Parms
{
	struct FString                                     sColName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.RecordCount
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execRecordCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgDataSet.Reinitialize
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execReinitialize_Parms
{
};

// Function TgClient.TgDataSet.Clear
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UTgDataSet_execClear_Parms
{
};

// Function TgClient.TgGameViewportClient.GameSessionEnded
// [0x00020802] ( FUNC_Event )
struct UTgGameViewportClient_eventGameSessionEnded_Parms
{
};

// Function TgClient.TgGameViewportClient.DrawTransition
// [0x00020000] 
struct UTgGameViewportClient_execDrawTransition_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGameViewportClient.Init
// [0x00420802] ( FUNC_Event )
struct UTgGameViewportClient_eventInit_Parms
{
	struct FString                                     OutError;                                         		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgGameViewportClient.NativeGameSessionEnded
// [0x00020400] ( FUNC_Native )
struct UTgGameViewportClient_execNativeGameSessionEnded_Parms
{
};

// Function TgClient.TgGameViewportClient.ClearDeferredManifests
// [0x00020400] ( FUNC_Native )
struct UTgGameViewportClient_execClearDeferredManifests_Parms
{
};

// Function TgClient.TgGameViewportClient.AddDeferredManifest
// [0x00020400] ( FUNC_Native )
struct UTgGameViewportClient_execAddDeferredManifest_Parms
{
	class UTgObjectReferencer*                         ObjReferencer;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgGameViewportClient.DetachHUDSettings
// [0x00020400] ( FUNC_Native )
struct UTgGameViewportClient_execDetachHUDSettings_Parms
{
};

// Function TgClient.TgGameViewportClient.CenterMouseInViewport
// [0x00024400] ( FUNC_Native )
struct UTgGameViewportClient_execCenterMouseInViewport_Parms
{
	unsigned long                                      CenterPreCaptureMousePos : 1;                     		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.ShowPathToAttentionPOI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct ATgHUD_Game_execShowPathToAttentionPOI_Parms
{
};

// Function TgClient.TgHUD_Game.StartVoiceMacroTree
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct ATgHUD_Game_execStartVoiceMacroTree_Parms
{
};

// Function TgClient.TgHUD_Game.ClearTriggeredSceneInfo
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventClearTriggeredSceneInfo_Parms
{
};

// Function TgClient.TgHUD_Game.SetTriggeredSceneInfo
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventSetTriggeredSceneInfo_Parms
{
	class AActor*                                      triggerActor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.CycleTrackedAssignment
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct ATgHUD_Game_execCycleTrackedAssignment_Parms
{
};

// Function TgClient.TgHUD_Game.ShowDevNotes
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execShowDevNotes_Parms
{
};

// Function TgClient.TgHUD_Game.BrowseToDevNotes
// [0x00020400] ( FUNC_Native )
struct ATgHUD_Game_execBrowseToDevNotes_Parms
{
};

// Function TgClient.TgHUD_Game.UpdateReleaseTime
// [0x00024002] 
struct ATgHUD_Game_execUpdateReleaseTime_Parms
{
	float                                              fReleaseTime;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class UTgUIReleaseMenus*                        relmenu;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.GetActiveReleaseMenu
// [0x00020002] 
struct ATgHUD_Game_execGetActiveReleaseMenu_Parms
{
	class UTgUIReleaseMenus*                           ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UTgUIReleaseMenus*                        relmenu;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ShowReleaseDialog
// [0x00024002] 
struct ATgHUD_Game_execShowReleaseDialog_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FDeathZoomInfo                              Info;                                             		// 0x0004 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fReleaseTime;                                     		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bCanManuallyRelease : 1;                          		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// class UTgUIReleaseMenus*                        relmenu;                                          		// 0x0028 (0x0004) [0x0000000000000000]              
	// class UTgUIScoreboard*                          scoreScene;                                       		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ShowDevSpawnBotMenu
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct ATgHUD_Game_execShowDevSpawnBotMenu_Parms
{
	class UTgUISceneDriver*                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UTgUIDevSpawnBot*                         sb;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ForceUpdateDeviceBar
// [0x00024002] 
struct ATgHUD_Game_execForceUpdateDeviceBar_Parms
{
	int                                                nActiveDeviceId;                                  		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.HideWorldInteractionText
// [0x00020002] 
struct ATgHUD_Game_execHideWorldInteractionText_Parms
{
};

// Function TgClient.TgHUD_Game.ShowWorldInteractionTextById
// [0x00020002] 
struct ATgHUD_Game_execShowWorldInteractionTextById_Parms
{
	int                                                nMsgId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.ShowWorldInteractionText
// [0x00020002] 
struct ATgHUD_Game_execShowWorldInteractionText_Parms
{
	struct FString                                     sMsg;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgClient.TgHUD_Game.HideProgressBar
// [0x00024002] 
struct ATgHUD_Game_execHideProgressBar_Parms
{
	unsigned long                                      bWorldInteractionBar : 1;                         		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.StartProgressBar
// [0x00024002] 
struct ATgHUD_Game_execStartProgressBar_Parms
{
	float                                              fDuration;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sLabel;                                           		// 0x0004 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bWorldInteractionBar : 1;                         		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.DisplayBadConnectionAlert
// [0x00020002] 
struct ATgHUD_Game_execDisplayBadConnectionAlert_Parms
{
	// class ATgPlayerController*                      PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.HideTaskForce
// [0x00020002] 
struct ATgHUD_Game_execHideTaskForce_Parms
{
};

// Function TgClient.TgHUD_Game.ShowTaskForce
// [0x00020002] 
struct ATgHUD_Game_execShowTaskForce_Parms
{
};

// Function TgClient.TgHUD_Game.SetReticuleVisibility
// [0x00020002] 
struct ATgHUD_Game_execSetReticuleVisibility_Parms
{
	unsigned long                                      bCrossHairVisible : 1;                            		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bWeaponStatusVisible : 1;                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.Tick
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.NativeTick
// [0x00020400] ( FUNC_Native )
struct ATgHUD_Game_execNativeTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.PlayZoomBlur
// [0x00020002] 
struct ATgHUD_Game_execPlayZoomBlur_Parms
{
};

// Function TgClient.TgHUD_Game.PlayZoomEffect
// [0x00024002] 
struct ATgHUD_Game_execPlayZoomEffect_Parms
{
	unsigned long                                      bEnable : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned char                                      ZoomType;                                         		// 0x0004 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.GetZoomEffectByAspectRatio
// [0x00820002] 
struct ATgHUD_Game_execGetZoomEffectByAspectRatio_Parms
{
	class UMaterialInstanceConstant*                   ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector2D                                ViewportSize;                                     		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ATgPlayerController*                      PC;                                               		// 0x000C (0x0004) [0x0000000000000000]              
	// class UTgGameViewportClient*                    Viewport;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           AspectRatio;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	// class UMaterialInstanceConstant*                baseZoom;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.SetZoomScope
// [0x00020002] 
struct ATgHUD_Game_execSetZoomScope_Parms
{
	struct FName                                       ScopeName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.DisplayDamage
// [0x00020002] 
struct ATgHUD_Game_execDisplayDamage_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             XL;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             nIconSize;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nTotalIcons;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.UpdateDamage
// [0x00020002] 
struct ATgHUD_Game_execUpdateDamage_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.CalcHitDirection
// [0x00820002] 
struct ATgHUD_Game_execCalcHitDirection_Parms
{
	struct FVector                                     HitDir;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  Loc;                                              		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 Rot;                                              		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           DirOfHit;                                         		// 0x0028 (0x0004) [0x0000000000000000]              
	// struct FVector                                  AxisX;                                            		// 0x002C (0x000C) [0x0000000000000000]              
	// struct FVector                                  AxisY;                                            		// 0x0038 (0x000C) [0x0000000000000000]              
	// struct FVector                                  AxisZ;                                            		// 0x0044 (0x000C) [0x0000000000000000]              
	// struct FVector                                  ShotDirection;                                    		// 0x0050 (0x000C) [0x0000000000000000]              
	// unsigned long                                   bIsInFront : 1;                                   		// 0x005C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector2D                                AngularDist;                                      		// 0x0060 (0x0008) [0x0000000000000000]              
	// float                                           PositionInQuadrant;                               		// 0x0068 (0x0004) [0x0000000000000000]              
	// float                                           Multiplier;                                       		// 0x006C (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.PlayHitEffect
// [0x00020002] 
struct ATgHUD_Game_execPlayHitEffect_Parms
{
	float                                              Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitDir;                                           		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  LocalPlayer;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	// unsigned long                                   PlayerIsZoomed : 1;                               		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function TgClient.TgHUD_Game.RadarMapRotates
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execRadarMapRotates_Parms
{
	unsigned long                                      RotatingMapStyle : 1;                             		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.LogBreak
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execLogBreak_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.SelectPreviousDevice
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execSelectPreviousDevice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.SelectNextDevice
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execSelectNextDevice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.UpdateSelectedDevice
// [0x00020102] 
struct ATgHUD_Game_execUpdateSelectedDevice_Parms
{
	class ATgDevice*                                   Dev;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.UsePickupDevice
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execUsePickupDevice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.SelectDeviceBarType
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execSelectDeviceBarType_Parms
{
	unsigned char                                      eType;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.SelectDeviceBarSlot
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execSelectDeviceBarSlot_Parms
{
	int                                                Slot;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.ToggleDrawAllHUD
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execToggleDrawAllHUD_Parms
{
	// class ATgPlayerController*                      PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UTgUIReleaseMenus*                        relmenu;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ToggleDrawPawnHUD
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execToggleDrawPawnHUD_Parms
{
};

// Function TgClient.TgHUD_Game.ShouldDrawPawnHUD
// [0x00020002] 
struct ATgHUD_Game_execShouldDrawPawnHUD_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.ToggleTargetExtraInfo
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execToggleTargetExtraInfo_Parms
{
};

// Function TgClient.TgHUD_Game.ShowRaidTab
// [0x00024802] ( FUNC_Event )
struct ATgHUD_Game_eventShowRaidTab_Parms
{
	int                                                nTab;                                             		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgClient.TgHUD_Game.CheckLevelUnlocks
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventCheckLevelUnlocks_Parms
{
	unsigned long                                      bIsTutorial : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UTgUIUnlockScene*                         unlockScene;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.OpenIntroScene
// [0x00024802] ( FUNC_Event )
struct ATgHUD_Game_eventOpenIntroScene_Parms
{
	float                                              FadeTime;                                         		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              TotalTime;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UUIScene*                                    ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UTgUIIntroScene*                          introScene;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	// class UUIScene*                                 OpenedScene;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.TgFxLightsOn
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct ATgHUD_Game_execTgFxLightsOn_Parms
{
	unsigned long                                      bOn : 1;                                          		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.OpenDevMenu
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct ATgHUD_Game_execOpenDevMenu_Parms
{
	// class UTgUIDevInGame*                           devScr;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.LiveTeamPerfStats
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execLiveTeamPerfStats_Parms
{
	// class ATgPlayerController*                      PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.IsForValidPlayer
// [0x00020002] 
struct ATgHUD_Game_execIsForValidPlayer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ATgPlayerController*                      PC;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ATgPawn*                                  localPawn;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ShowEndRaidScreen
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventShowEndRaidScreen_Parms
{
	unsigned long                                      bAttackerWon : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UTgUIEndRaidScreen*                       endRaidScene;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	// class UTgUIScoreboard*                          scoreScene;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ShowQuestEndMissionScene
// [0x00020002] 
struct ATgHUD_Game_execShowQuestEndMissionScene_Parms
{
	unsigned long                                      MissionVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      PlayerVictor : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UTgUIEndQuestMission*                     endMissionScene;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ShowEndMissionScreen
// [0x00020002] 
struct ATgHUD_Game_execShowEndMissionScreen_Parms
{
	unsigned long                                      MissionVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      PlayerVictor : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UTgUIEndMissionScreen*                    endMissionScene;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.UpdateScoreBoard
// [0x00020002] 
struct ATgHUD_Game_execUpdateScoreBoard_Parms
{
	unsigned long                                      bPlayerVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgClient.TgHUD_Game.CloseConfirmPopup
// [0x00024802] ( FUNC_Event )
struct ATgHUD_Game_eventCloseConfirmPopup_Parms
{
	class UFunction*                                   callbackPtr;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTellGameClient : 1;                              		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// class UTgUIConfirmPopup*                        confirmPopup;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.CreateConfirmPopup
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventCreateConfirmPopup_Parms
{
	struct FString                                     Message;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UFunction*                                   callbackPtr;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UTgUIConfirmPopup*                        confirmPopup;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ViewItemPreview
// [0x00020802] ( FUNC_Event )
struct ATgHUD_Game_eventViewItemPreview_Parms
{
	class UTgInventoryObject*                          Item;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UTgUIPreviewScreen*                          ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UTgUIPreviewScreen*                       previewPopup;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.ToggleMainMenuScreen
// [0x00020A02] ( FUNC_Exec | FUNC_Event )
struct ATgHUD_Game_execToggleMainMenuScreen_Parms
{
	class UTgUISceneDriver*                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgClient.TgHUD_Game.OpenSkillScreen
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execOpenSkillScreen_Parms
{
	// class ATgPlayerController*                      PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	// class ATgPawn*                                  localPawn;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgClient.TgHUD_Game.OpenInventoryLog
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execOpenInventoryLog_Parms
{
};

// Function TgClient.TgHUD_Game.OpenItemModScreen
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_Game_execOpenItemModScreen_Parms
{
};

// Function TgClient.TgHUD_Game.OpenAgentScreen
// [0x00024202] ( FUNC_Exec )
struct ATgHUD_Game_execOpenAgentScreen_Parms
{
	unsigned long                                      bIsTutorial : 1;                                  		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
