/*
#############################################################################################
# Global Agenda (1.5.1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct TgClient.TgAchievementData.TgClientPlayerAchievementInfo
// 0x0014
struct FTgClientPlayerAchievementInfo
{
	unsigned long                                      m_bCompleted : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_nProgress;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     m_Date;                                           		// 0x0008 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgAgencyData.sAgencyMemberInfo
// 0x004C
struct FsAgencyMemberInfo
{
	struct FString                                     sMemberName;                                      		// 0x0000 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nMemberRankId;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nMemberRankLevel;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      eMemberStatus;                                    		// 0x0014 (0x0001) [0x0000000000000000]              
	int                                                nMemberLocationId;                                		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     sMemberLocationString;                            		// 0x001C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nMemberPlayerId;                                  		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                nMemberLevel;                                     		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                nMemberProfileId;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
	struct FString                                     sPublicComment;                                   		// 0x0034 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sOfficerComment;                                  		// 0x0040 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgAgencyData.sAgencyRankData
// 0x0018
struct FsAgencyRankData
{
	int                                                nRankId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nRankLevel;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nRankPermissions;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FString                                     sRankName;                                        		// 0x000C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgAllianceData.sAllianceMemberInfo
// 0x0024
struct FsAllianceMemberInfo
{
	struct FString                                     sMemberName;                                      		// 0x0000 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sLeaderName;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nMemberAgencyId;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nMemberCount;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nTerritoryCount;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgDataInterface.CharacterInfoStruct
// 0x0038
struct FCharacterInfoStruct
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nProfileId;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nRoleId;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nHeadAsmId;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nSkinMatParamId;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nEyeMatParamId;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nHairAsmId;                                       		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                nGenderTypeId;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                nMapGameId;                                       		// 0x0028 (0x0004) [0x0000000000000000]              
	TArray< int >                                      nMorphSettings;                                   		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgHUD_Game.DamageDirectionInfo
// 0x0018
struct FDamageDirectionInfo
{
	float                                              FadeTime;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              FadeValue;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   MatConstant;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FVector                                     OriginalHitDirection;                             		// 0x000C (0x000C) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgHUD_Game.DigitData
// 0x0010
struct FDigitData
{
	int                                                LeftPos;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                TopPos;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                Width;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                Height;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIMainMenu.sMainMenuButton
// 0x0010
struct FsMainMenuButton
{
	class UUIButton*                                   mmbButton;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    mmbLabel;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    mmbKeyBind;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                mmbFunctionID;                                    		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIMainMenu.sContextItemData
// 0x0010
struct FsContextItemData
{
	struct FString                                     cidString;                                        		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                cidFunctionID;                                    		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIReleaseMenus.sBasicReleaseDialog
// 0x001C
struct FsBasicReleaseDialog
{
	unsigned long                                      m_bActive : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	class UUIPanel*                                    m_Panel;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_TimeReleaseDataSet;                             		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_SecondsBeforeAutorelease;                       		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bCanReleaseNow : 1;                             		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	class UUIButton*                                   m_ReleaseNowButton;                               		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_TimeLabel;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgStatsData.Scores
// 0x006C
struct FScores
{
	int                                                Score[ 0xC ];                                     		// 0x0000 (0x0030) [0x0000000000000000]              
	struct FString                                     sPlayerName;                                      		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sClassName;                                       		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sAgencyName;                                      		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nTaskForce;                                       		// 0x0054 (0x0004) [0x0000000000000000]              
	unsigned long                                      bHighlight : 1;                                   		// 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bAlive : 1;                                       		// 0x0058 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                eBonusType;                                       		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                nTeamIndex;                                       		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                nLevel;                                           		// 0x0064 (0x0004) [0x0000000000000000]              
	int                                                nClassID;                                         		// 0x0068 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver.sTgUIRotatorInit
// 0x0020
struct FsTgUIRotatorInit
{
	class AActor*                                      targetModel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UTgUISkeletalMeshWidget*                     targetUISkelMesh;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIScreenObject*                             dragRegionObject;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bEnableYaw : 1;                                   		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bEnablePitch : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	class UUIButton*                                   yawLeft;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   yawRight;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   pitchUp;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   pitchDown;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver.sTgUIRotator
// 0x002C
struct FsTgUIRotator
{
	struct FsTgUIRotatorInit                           rotInit;                                          		// 0x0000 (0x0020) [0x0000000000000000]              
	unsigned long                                      bValid : 1;                                       		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bActive : 1;                                      		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bStaticActive : 1;                                		// 0x0020 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bStaticNegative : 1;                              		// 0x0020 (0x0004) [0x0000000000000000] [0x00000008] 
	int                                                nlastMoveYaw;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                nlastMovePitch;                                   		// 0x0028 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver.sPagingPanel
// 0x0018
struct FsPagingPanel
{
	class UUIPanel*                                    PagingPanel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    PagingLabel;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   LastButton;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   FirstButton;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   PrevButton;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   NextButton;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.sToolTipData
// 0x0030
struct FsToolTipData
{
	struct FString                                     sToolTipName;                                     		// 0x0000 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sToolTipValue;                                    		// 0x000C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nToolTipType;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nSortBy;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	struct FLinearColor                                colorNameOverride;                                		// 0x0020 (0x0010) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.sTooltipMsg
// 0x000C
struct FsTooltipMsg
{
	int                                                m_nHeaderId;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_nBodyId;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bRequiresRestart : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.sToolTip
// 0x002C
struct FsToolTip
{
	class UUIPrefabInstance*                           wToolTip;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    wToolTipPanel;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    wToolTipHeader;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    wToolTipDescription;                              		// 0x000C (0x0004) [0x0000000000000000]              
	class UTgUIScrollList*                             wToolTipBaseStatSL;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    wToolTipDescription2;                             		// 0x0014 (0x0004) [0x0000000000000000]              
	class UTgUIScrollList*                             wToolTipRndStatModSL;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    wToolTipBottom;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	TArray< struct FsToolTipData >                     sToolTipData;                                     		// 0x0020 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.EffectValue
// 0x0008
struct FEffectValue
{
	float                                              val;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FPointer                                    pEffect;                                          		// 0x0004 (0x0004) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.sConfirmPopupStruct
// 0x0060
struct FsConfirmPopupStruct
{
	class UUIPrefabInstance*                           m_wConfirmPopup;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wConfirmPanel;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wConfirmText;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wItemPanel;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wItemSizePanel;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	class UTgUIPrimaryHUD_SlotWidgets*                 m_wItem;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wItemLabel;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wAmountPanel;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wAmountSizePanel;                               		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_wLeftArrowImage;                                		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_wRightArrowImage;                               		// 0x0028 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wAmountTypeLabel;                               		// 0x002C (0x0004) [0x0000000000000000]              
	class UUIEditBox*                                  m_wAmountEditBox;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wAmountMaxLabel;                                		// 0x0034 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wTextPanel;                                     		// 0x0038 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wTextTypeLabel;                                 		// 0x003C (0x0004) [0x0000000000000000]              
	class UUIEditBox*                                  m_wTextEditBox;                                   		// 0x0040 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_wOptionPanel;                                   		// 0x0044 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_wConfirmYesButton;                              		// 0x0048 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wConfirmYesLabel;                               		// 0x004C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_wConfirmNoButton;                               		// 0x0050 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wConfirmNoLabel;                                		// 0x0054 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_wConfirmOkButton;                               		// 0x0058 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_wConfirmOkLabel;                                		// 0x005C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUISceneDriver_Tooltip.sConfirmDataStruct
// 0x001C
struct FsConfirmDataStruct
{
	int                                                m_nConfirmMode;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_nConfirmModeIndex;                              		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_nMaxItems;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_nNumItems;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                m_nHexPosition;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
	class UTgInventoryObject*                          m_pItem;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                m_nItemId;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyDirectory.AgencyDirectoryStruct
// 0x0038
struct FAgencyDirectoryStruct
{
	class UUIPrefabInstance*                           AgencyInstance;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   AgencyButton;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    AgencyHighlight;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nAgencyId;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgencyName;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgencyMembers;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgencyRank;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AllianceName;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AllianceMembers;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    NonSubAllowed;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FString                                     AgencyMessage;                                    		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bRecruiting : 1;                                  		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSubOnly : 1;                                     		// 0x0034 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TgClient.TgUIAgencyMenu_Alliance.AllianceMemberDisplayStruct
// 0x0014
struct FAllianceMemberDisplayStruct
{
	class UUIPrefabInstance*                           AllianceMemberPanelInstance;                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   AllianceMemberButton;                             		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AllianceMemberName;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    AllianceMemberHighlight;                          		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nMemberAgencyId;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Facilities.HexInfoStruct
// 0x0040
struct FHexInfoStruct
{
	class UUIPanel*                                    HexInfoPanel;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    HeaderLabel;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    BuildingLabel;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   BuildingButton;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    OutputValueLabel;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    HqPenaltyLabel;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    ResourceBonusLabel;                               		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    ResourceBonusTypeLabel;                           		// 0x001C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AdjacencyBonusLabel;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AdjustedOutputLabel;                              		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    InefficiencyLabel;                                		// 0x0028 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    TotalOutputLabel;                                 		// 0x002C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   ChangeFacilityButton;                             		// 0x0030 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   ChangeHQButton;                                   		// 0x0034 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   TransferButton;                                   		// 0x0038 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   AbandonButton;                                    		// 0x003C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Facilities.FacilityMemberStruct
// 0x0024
struct FFacilityMemberStruct
{
	class UUILabel*                                    memberName;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberCount;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberCost;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    memberHighlight;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   memberCancelButton;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nHpQueId;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nItemId;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nCount;                                           		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nCost;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Facilities.FacilityQueueStruct
// 0x0044
struct FFacilityQueueStruct
{
	class UUIPanel*                                    QueueInfoPanel;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    HeaderLabel;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    CurrentTaskLabel;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	class UTgUIPrimaryHUD_SlotWidgets*                 CurrentTaskItem;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIImage*                                    CurrentTaskProgressBar;                           		// 0x0010 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   CurrentTaskProgressBarMIC;                        		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    CurrentTaskProgressLabel;                         		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   CurrentTaskCancelButton;                          		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nActivenHpQueId;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                nActiveItemId;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                nActiveCount;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                nActiveCost;                                      		// 0x002C (0x0004) [0x0000000000000000]              
	class UTgUIScrollList*                             PendingTaskScrollList;                            		// 0x0030 (0x0004) [0x0000000000000000]              
	TArray< struct FFacilityMemberStruct >             PendingTaskMembers;                               		// 0x0034 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UUIButton*                                   AddTaskButton;                                    		// 0x0040 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Facilities.DefensiveConfigStruct
// 0x0024
struct FDefensiveConfigStruct
{
	class UUIPanel*                                    DefenseInfoPanel;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   DefenseButtons[ 0x6 ];                            		// 0x0004 (0x0018) [0x0000000000000000]              
	class UUIButton*                                   ApplyButton;                                      		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nLocalDefensePosition;                            		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_General.sAgencyMemberDisplay
// 0x0024
struct FsAgencyMemberDisplay
{
	class UUIImage*                                    memberClass;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberName;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberRank;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberStatus;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    memberLevel;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   memberPanelButton;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    memberHighlight;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIPrefabInstance*                           memberPanelInstance;                              		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nMemberPlayerId;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_General.sCommentPanel
// 0x000C
struct FsCommentPanel
{
	class UUIPanel*                                    panel;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   editButton;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    textLabel;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_General.sMemberDetailPanel
// 0x0048
struct FsMemberDetailPanel
{
	class UUILabel*                                    nameLabel;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    detailPanel;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    historyLabel;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    rankValueLabel;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    joinedValueLabel;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    wlValueLabel;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    lastOnlineValueLabel;                             		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   playerSearchHotlinkButton;                        		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   promoteMemberButton;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   demoteMemberButton;                               		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   removeMemberButton;                               		// 0x0028 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   teaminviteMemberButton;                           		// 0x002C (0x0004) [0x0000000000000000]              
	struct FsCommentPanel                              publicCommentPanel;                               		// 0x0030 (0x000C) [0x0000000000000000]              
	struct FsCommentPanel                              officerCommentPanel;                              		// 0x003C (0x000C) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_General.sPopupTextEditPanel
// 0x0014
struct FsPopupTextEditPanel
{
	class UUIPanel*                                    popupPanel;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    popupHeaderLabel;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIEditBox*                                  popupEditBox;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   popupAcceptButton;                                		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   popupCancelButton;                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Inventory.sInventoryListItem
// 0x0028
struct FsInventoryListItem
{
	class UTgUIPrimaryHUD_SlotWidgets*                 wItem;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class UTgInventoryObject*                          pItem;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_InvMain;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_InvCount;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_InvName;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_InvType;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_InvGen;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_InvQuality;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_InvHighlight;                                   		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                m_nItemCount;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Inventory.sAgencyInvPanel
// 0x0044
struct FsAgencyInvPanel
{
	class UUIPanel*                                    m_InventoryPanel;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_CreditLabel;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	class UTgUIScrollList*                             m_InventoryScrollFrame;                           		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_ItemButton;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_CreditButton;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_DeleteButton;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                m_nSortType;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bSortAscending : 1;                             		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	class UUIButton*                                   m_HeaderName;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_HeaderQuantity;                                 		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                m_nPageNum;                                       		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FsPagingPanel                               m_PagingPanel;                                    		// 0x002C (0x0018) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_InventoryLog.InventoryLogStruct
// 0x001C
struct FInventoryLogStruct
{
	class UUIPrefabInstance*                           LogInstance;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    DateLabel;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    TimeLabel;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    PlayerLabel;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    EventLabel;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    ItemLabel;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    QuantityLabel;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Management.sRankDisplay
// 0x0014
struct FsRankDisplay
{
	class UUILabel*                                    rankNameLabel;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   rankButton;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    rankHighlight;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIPrefabInstance*                           rankPanelInstance;                                		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                rankIndex;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Management.sRankDetailPanel
// 0x0048
struct FsRankDetailPanel
{
	class UUIPanel*                                    detailPanel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   detailPromoteButton;                              		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   detailDemoteButton;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   detailRemoveButton;                               		// 0x000C (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    detailCoverPanel;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   detailCoverButton;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUIEditBox*                                  detailNameEditBox;                                		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailOfficerCommentEditCheckBox;                 		// 0x001C (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailOfficerCommentViewCheckBox;                 		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailPublicCommentEditCheckBox;                  		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailMOTDEditCheckBox;                           		// 0x0028 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailDescriptionEditCheckBox;                    		// 0x002C (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailInvitePlayerCheckBox;                       		// 0x0030 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailPromotePlayerCheckBox;                      		// 0x0034 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailDemotePlayerCheckBox;                       		// 0x0038 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailRemovePlayerCheckBox;                       		// 0x003C (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailFacilityMgmtCheckBox;                       		// 0x0040 (0x0004) [0x0000000000000000]              
	class UUICheckbox*                                 detailRemoveInvCheckBox;                          		// 0x0044 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgencyMenu_Recruiting.AgentSubmissionStruct
// 0x004C
struct FAgentSubmissionStruct
{
	class UUIPrefabInstance*                           AgentInstance;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   AgentButton;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgentName;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgentClass;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgentDate;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgentLevel;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    AgentSkill;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    AgentClassIcon;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIImage*                                    AgentSkillStars;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    AgentHighlight;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                AgentCharacterId;                                 		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FString                                     AgentMessage;                                     		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     AgentNameString;                                  		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FDouble                                     ApplicationDate;                                  		// 0x0044 (0x0008) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Achievement.AchievementData
// 0x0010
struct FAchievementData
{
	struct FPointer                                    m_AchSetup;                                       		// 0x0000 (0x0004) [0x0000000000101000]              ( CPF_Native )
	struct FPointer                                    m_PlayerAch;                                      		// 0x0004 (0x0004) [0x0000000000101000]              ( CPF_Native )
	unsigned long                                      m_bValid : 1;                                     		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_nAchievementId;                                 		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Achievement.AchievementGroupData
// 0x0014
struct FAchievementGroupData
{
	int                                                m_nGroupId;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FPointer                                    m_Group;                                          		// 0x0004 (0x0004) [0x0000000000101000]              ( CPF_Native )
	TArray< struct FAchievementData >                  m_Achievements;                                   		// 0x0008 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct TgClient.TgUIAgentProfile_Achievement.AchievedBG
// 0x000C
struct FAchievedBG
{
	class UUIPanel*                                    m_BasePanel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_Background;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_SelectedPanel;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Achievement.AchievementItem
// 0x005C
struct FAchievementItem
{
	class UUIButton*                                   m_BaseButton;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_BadgeButton;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_BadgeIcon;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    m_RewardPanel;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	class UTgUIInvWidget*                              m_RewardSlot;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_RewardLabel;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_NameLabel;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_DescrLabel;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIButton*                                   m_ProgressButton;                                 		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIImage*                                    m_ProgressBar;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_AchievedDateLabel;                              		// 0x0028 (0x0004) [0x0000000000000000]              
	struct FAchievedBG                                 m_AchievedBG;                                     		// 0x002C (0x000C) [0x0000000000000000]              
	struct FAchievedBG                                 m_NotAchievedBG;                                  		// 0x0038 (0x000C) [0x0000000000000000]              
	struct FAchievementData                            m_AchievementData;                                		// 0x0044 (0x0010) [0x0000000000000000]              
	class UTgInventoryObject*                          m_RewardImposter;                                 		// 0x0054 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_ProgressBarMIC;                                 		// 0x0058 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Achievement.AchievementGroup
// 0x000C
struct FAchievementGroup
{
	class UUIButton*                                   m_CatButton;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    m_CatLabel;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_nGroupId;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Equip.EquippedItemStruct
// 0x0010
struct FEquippedItemStruct
{
	class UUIPanel*                                    devicePanel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class UTgUIInvWidget*                              deviceWidget;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	class UUIProgressBar*                              deviceDurabilityBar;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	class UUIButton*                                   deviceRepairButton;                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Equip.DeviceListItemStruct
// 0x0020(0x0030 - 0x0010)
struct FDeviceListItemStruct : FEquippedItemStruct
{
	class UUIButton*                                   deviceButton;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    deviceNameLabel;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    deviceSkillLabel;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    deviceGenLabel;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    selectedHLPanel;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    mouseOverPanel;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    deviceGenTitleLabel;                              		// 0x0028 (0x0004) [0x0000000000000000]              
	class UUILabel*                                    deviceDurTitleLabel;                              		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Equip.sTutTypePanels
// 0x0010
struct FsTutTypePanels
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	class UUIPanel*                                    StepPanels[ 0x3 ];                                		// 0x0004 (0x000C) [0x0000000000000000]              
};

// ScriptStruct TgClient.TgUIAgentProfile_Inventory.sSalvagedItem
// 0x0014
struct FsSalvagedItem
{
	class UTgUIInvWidget*                              wItem;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
