/*
#############################################################################################
# Global Agenda (1.5.1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgClient_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_AGENCYFILTER_OFFLINE                               0x1
#define CONST_AGENCYFILTER_ONLINE                                0x2
#define CONST_TG_AGENCY_REQUEST_THROTTLE_TIMER                   2.0f
#define CONST_MAX_RANK_NAME_LENGTH                               25
#define CONST_TG_ALLIANCE_REQUEST_THROTTLE_TIMER                 5.0f
#define CONST_MATCH_TYPE_PVE                                     1021
#define CONST_MATCH_TYPE_PVP                                     1022
#define CONST_MATCH_TYPE_TRAINING                                1188

	BOX_SMOOTH_FPS                                     = 1,
	BOX_COMPOSITE_LIGHTS                               = 2,
	BOX_DIRECTIONAL_LIGHTMAPS                          = 3,
	BOX_DYNAMIC_SHADOWS                                = 4,
	BOX_COMPOSITE_SHADOWS                              = 5,
	BOX_HIGH_QUALITY_MATERIALS                         = 6,
	BOX_HIGH_CHARACTER_LOD                             = 7,
	BOX_SHADOWED_PLAYER_NAMES                          = 8,
	BOX_STATIC_DECALS                                  = 9,
	BOX_DYNAMIC_DECALS                                 = 10,
	BOX_FOLIAGE                                        = 11,
	BOX_BLOOM                                          = 12,
	BOX_DISTORTION                                     = 13,
	BOX_MOTION_BLUR                                    = 14,
	BOX_AMBIENT_OCCLUSION                              = 15,
	BOX_DEPTH_OF_FIELD                                 = 16,
	BOX_LENS_FLARE                                     = 17,
	BOX_D3D10                                          = 18,
	BOX_MAX                                            = 19
};*/

// Enum TgClient.TgUISettingsMenu_Video.eVideoOptionComboBoxes
/*enum eVideoOptionComboBoxes
{
	COMBO_PARTICLE_DETAIL                              = 0,
	COMBO_SHADOW_FILTERING                             = 1,
	COMBO_TEXTURE_FILTERING                            = 2,
	COMBO_ANISO_QUALITY                                = 3,
	COMBO_CHARACTER_TEXTURES                           = 4,
	COMBO_WORLD_TEXTURES                               = 5,
	COMBO_EFFECT_TEXTURES                              = 6,
	COMBO_MSAA_QUALITY                                 = 7,
	COMBO_MAX                                          = 8
};*/

// Enum TgClient.TgUISettingsMenu_Video.eVideoOptionWindowType
/*enum eVideoOptionWindowType
{
	VIDEOWINDOW_WINDOWED                               = 0,
	VIDEOWINDOW_FULLSCREEN                             = 1,
	VIDEOWINDOW_BORDERLESS                             = 2,
	VIDEOWINDOW_MAX                                    = 3
};*/

// Enum TgClient.TgUITutorialItem.ETutClassDevType
/*enum ETutClassDevType
{
	TutDev_Melee                                       = 0,
	TutDev_Ranged                                      = 1,
	TutDev_Offhand1                                    = 2,
	TutDev_Specialty                                   = 3,
	TutDev_Offhand2                                    = 4,
	TutDev_MAX                                         = 5
};*/

// Enum TgClient.TgUIUnlockScene.eUnlockTypes
/*enum eUnlockTypes
{
	UNLOCK_DEVICE                                      = 0,
	UNLOCK_ARMOR                                       = 1,
	UNLOCK_SKILL_POINT                                 = 2,
	UNLOCK_MAX                                         = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TgClient.TgAchievementData
// 0x0040 (0x007C - 0x003C)
class UTgAchievementData : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x3C ];                            		// 0x003C (0x003C) UNKNOWN PROPERTY: MapProperty TgClient.TgAchievementData.m_AchievementRecords
	unsigned long                                      m_bDataArrived : 1;                               		// 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1588 ];

		return pClassPointer;
	};

};

UClass* UTgAchievementData::pClassPointer = NULL;

// Class TgClient.TgAgencyData
// 0x009C (0x00D8 - 0x003C)
class UTgAgencyData : public UObject
{
public:
	TArray< struct FsAgencyMemberInfo >                m_MemberListInfo;                                 		// 0x003C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FsAgencyMemberInfo >                m_MemberListInfoSorted;                           		// 0x0048 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FsAgencyRankData >                  m_RankListData;                                   		// 0x0054 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned char                                      m_CurrentSortType;                                		// 0x0060 (0x0001) [0x0000000000000000]              
	int                                                m_CurrentFilter;                                  		// 0x0064 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	int                                                m_SortedFilter;                                   		// 0x0068 (0x0004) [0x0000000000000000]              
	struct FPointer                                    m_HexMapData;                                     		// 0x006C (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    m_InventoryData;                                  		// 0x0070 (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FString                                     m_Name;                                           		// 0x0074 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_MOTD;                                           		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_Information;                                    		// 0x008C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_Abbreviation;                                   		// 0x0098 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nLogoResId;                                     		// 0x00A4 (0x0004) [0x0000000000000000]              
	int                                                m_nCurrency;                                      		// 0x00A8 (0x0004) [0x0000000000000000]              
	int                                                m_nSiteId;                                        		// 0x00AC (0x0004) [0x0000000000000000]              
	float                                              m_fTaxPercent;                                    		// 0x00B0 (0x0004) [0x0000000000000000]              
	int                                                m_nAgencyId;                                      		// 0x00B4 (0x0004) [0x0000000000000000]              
	int                                                m_nNumMembers;                                    		// 0x00B8 (0x0004) [0x0000000000000000]              
	int                                                m_nLocalPlayerId;                                 		// 0x00BC (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bNoAgency : 1;                                  		// 0x00C0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bRecruiting : 1;                                		// 0x00C0 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bRecruitingNonSub : 1;                          		// 0x00C0 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FString                                     m_sRecruitingText;                                		// 0x00C4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fLastDataRequestTime;                           		// 0x00D0 (0x0004) [0x0000000000000000]              
	int                                                m_PendingUpdateFlags;                             		// 0x00D4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1589 ];

		return pClassPointer;
	};

	struct FsAgencyRankData eventGetDefaultRankData ( );
	struct FsAgencyMemberInfo eventGetDefaultMemberInfo ( );
	void Tick ( float DeltaTime );
	void SetTax ( float fTax );
	void SetDescription ( struct FString sDescription );
	void SetOfficerComment ( int nPlayerId, struct FString sNote );
	void SetPublicComment ( int nPlayerId, struct FString sNote );
	void SetMOTD ( struct FString sMOTD );
	void TransferLeader ( struct FString sPlayerName );
	void Disband ( );
	void Create ( struct FString sAgencyName, struct FLinearColor AgencyColor );
	void Invite ( struct FString sPlayerName );
	void Remove ( int nPlayerId );
	void Demote ( int nPlayerId );
	void Promote ( int nPlayerId );
	void UpdateRecruiting ( struct FString sText, unsigned long bRecruiting, unsigned long bSubOnly );
	bool CheckFiltered ( struct FsAgencyMemberInfo Info, int nFilter );
	void SetFilter ( int nNewFilter );
	int GetNumMembersOfRank ( int nRankId );
	bool LocalPlayerHasPermission ( int flag );
	bool LocalPlayerIsLeader ( );
	struct FsAgencyMemberInfo GetLocalPlayerInfo ( );
	struct FsAgencyMemberInfo GetMemberInfo ( int nPlayerId );
	struct FsAgencyRankData GetLocalRankData ( );
	struct FsAgencyRankData GetRankData ( int nRank );
	void ClearData ( int rosterflags );
	bool RequestAgencyInfo ( int Flags );
	TArray< struct FsAgencyMemberInfo > GetSortedInfoArray ( );
	void InitAgencyData ( );
};

UClass* UTgAgencyData::pClassPointer = NULL;

// Class TgClient.TgAllianceData
// 0x0068 (0x00A4 - 0x003C)
class UTgAllianceData : public UObject
{
public:
	struct FString                                     m_Name;                                           		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_MOTD;                                           		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_Information;                                    		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_Abbreviation;                                   		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nAllianceId;                                    		// 0x006C (0x0004) [0x0000000000000000]              
	int                                                m_nOwnerAgencyId;                                 		// 0x0070 (0x0004) [0x0000000000000000]              
	struct FString                                     m_OwnerAgencyName;                                		// 0x0074 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_nNumMembers;                                    		// 0x0080 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bNoAlliance : 1;                                		// 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< struct FsAllianceMemberInfo >              m_MemberListInfo;                                 		// 0x0088 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fLastDataRequestTime;                           		// 0x0094 (0x0004) [0x0000000000000000]              
	int                                                m_PendingUpdateFlags;                             		// 0x0098 (0x0004) [0x0000000000000000]              
	struct FDouble                                     m_dtCreated;                                      		// 0x009C (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1590 ];

		return pClassPointer;
	};

	struct FsAllianceMemberInfo eventGetDefaultMemberInfo ( );
	void Disband ( );
	void Remove ( int nAgencyId );
	void Invite ( struct FString sPlayerName );
	void Create ( struct FString sName );
	struct FsAllianceMemberInfo GetMemberInfo ( int nAgencyId );
	void Tick ( float DeltaSeconds );
	void ClearData ( unsigned long bGeneralData, unsigned long bMemberData );
	bool RequestAllianceInfo ( int Flags );
};

UClass* UTgAllianceData::pClassPointer = NULL;

// Class TgClient.TgAttentionData
// 0x0004 (0x0040 - 0x003C)
class UTgAttentionData : public UObject
{
public:
	unsigned long                                      c_bPressedMissionKey : 1;                         		// 0x003C (0x0004) [0x0000000000044000] [0x00000001] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      c_bPressedEscKey : 1;                             		// 0x003C (0x0004) [0x0000000000044000] [0x00000002] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      c_bPressedMapKey : 1;                             		// 0x003C (0x0004) [0x0000000000044000] [0x00000004] ( CPF_Config | CPF_GlobalConfig )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1591 ];

		return pClassPointer;
	};

};

UClass* UTgAttentionData::pClassPointer = NULL;

// Class TgClient.TgConsole
// 0x0004 (0x01F4 - 0x01F0)
class UTgConsole : public UConsole
{
public:
	unsigned long                                      m_bEnabled : 1;                                   		// 0x01F0 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1592 ];

		return pClassPointer;
	};

	bool InputKey ( int ControllerId, struct FName Key, unsigned char Event, float AmountDepressed, unsigned long bGamepad );
	void SetEnabled ( unsigned long bEnabled );
};

UClass* UTgConsole::pClassPointer = NULL;

// Class TgClient.TgDataInterface
// 0x0000 (0x003C - 0x003C)
class UTgDataInterface : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1593 ];

		return pClassPointer;
	};

	void GetLocalBotList ( class UTgDataSet* pDataSet );
	void GetInstanceList ( class UTgDataSet* pDataSet );
	void QueryPlayers ( class UTgDataSet* pDataSet );
	void GetCharacterStats ( class UTgDataSet* pDataSet );
	void GetLootTableItems ( int nLootTableId, int nProfileId, class UTgDataSet* pDataSet );
	void AddCharacter ( struct FCharacterInfoStruct CharInfo, class UTgDataSet* pDataSet );
};

UClass* UTgDataInterface::pClassPointer = NULL;

// Class TgClient.TgDataSet
// 0x0014 (0x0050 - 0x003C)
class UTgDataSet : public UObject
{
public:
	int                                                m_nCallbackObject;                                		// 0x003C (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FName                                       m_nmCallbackFunc;                                 		// 0x0040 (0x0008) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    m_pMarshal;                                       		// 0x0048 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	struct FPointer                                    m_pRowSet;                                        		// 0x004C (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1594 ];

		return pClassPointer;
	};

	void MakeRequest ( struct FString sFuncName );
	void UpdateParam ( struct FString sName, struct FString sValue );
	void AddParam ( struct FString sName, struct FString sValue );
	void CallRegisteredForEvents ( unsigned char eEventType );
	void RegisterForEvents ( class UObject* pObject, struct FName nmFuncName );
	struct FString GetErrorText ( );
	struct FString GetErrorColumn ( );
	int GetErrorCode ( );
	void AddCurrentRow ( class UTgDataSet* pDataSet );
	void Sort ( struct FString sColName, unsigned long bAscending );
	void DeleteAll ( unsigned long bUpdateBound );
	void DeleteRow ( );
	void AddRow ( );
	bool GoToRowSet ( int nTokenId );
	bool MoveTo ( int nRowNumber );
	bool MoveLast ( );
	bool MoveNext ( );
	bool MoveFirst ( );
	void SetNbrColValue ( struct FString sColName, float fValue );
	void SetStrColValue ( struct FString sColName, struct FString sValue );
	float GetNbrColValue ( struct FString sColName );
	struct FString GetStrColValueByRow ( struct FString sColName, int iRowId );
	struct FString GetStrColValue ( struct FString sColName );
	struct FString GetStrColText ( struct FString sColName );
	int GetCurrentRowId ( );
	bool ColumnEmptyOrNull ( struct FString sColName );
	int RecordCount ( );
	void Reinitialize ( );
	void Clear ( );
};

UClass* UTgDataSet::pClassPointer = NULL;

// Class TgClient.TgGameViewportClient
// 0x000C (0x0108 - 0x00FC)
class UTgGameViewportClient : public UTgViewportClient
{
public:
	TArray< class UTgObjectReferencer* >               m_DeferredManifests;                              		// 0x00FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1595 ];

		return pClassPointer;
	};

	void eventGameSessionEnded ( );
	void DrawTransition ( class UCanvas* Canvas );
	bool eventInit ( struct FString* OutError );
	void NativeGameSessionEnded ( );
	void ClearDeferredManifests ( );
	void AddDeferredManifest ( class UTgObjectReferencer* ObjReferencer );
	void DetachHUDSettings ( );
	void CenterMouseInViewport ( unsigned long CenterPreCaptureMousePos );
};

UClass* UTgGameViewportClient::pClassPointer = NULL;

// Class TgClient.TgHUD_Game
// 0x0320 (0x08BC - 0x059C)
class ATgHUD_Game : public ATgHUD
{
public:
	class UTexture2D*                                  m_BarTexture;                                     		// 0x059C (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  m_CutoutTexture;                                  		// 0x05A0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  m_ColorTexture;                                   		// 0x05A4 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  m_TargetTexture;                                  		// 0x05A8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FDigitData                                  m_DigitInfo[ 0xA ];                               		// 0x05AC (0x00A0) [0x0000000000000000]              
	struct FColor                                      m_HUDTeamColor;                                   		// 0x064C (0x0004) [0x0000000000000000]              
	int                                                m_nTextPanelWidth;                                		// 0x0650 (0x0004) [0x0000000000000000]              
	int                                                m_nTextPanelHeight;                               		// 0x0654 (0x0004) [0x0000000000000000]              
	int                                                m_nTeamPanelWidth;                                		// 0x0658 (0x0004) [0x0000000000000000]              
	int                                                m_nTeamPanelHeight;                               		// 0x065C (0x0004) [0x0000000000000000]              
	int                                                m_nTeamIconHeight;                                		// 0x0660 (0x0004) [0x0000000000000000]              
	class APlayerReplicationInfo*                      m_NamedPlayer;                                    		// 0x0664 (0x0004) [0x0000000000000000]              
	float                                              m_NameTime;                                       		// 0x0668 (0x0004) [0x0000000000000000]              
	class UMaterial*                                   m_LockAlertMat;                                   		// 0x066C (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_LockAlertMIC;                                   		// 0x0670 (0x0004) [0x0000000000000000]              
	int                                                m_nEDLastUpdated;                                 		// 0x0674 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bDrawPawnHUD : 1;                               		// 0x0678 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bBlockPawnHUD : 1;                              		// 0x0678 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bDrawTaskForce : 1;                             		// 0x0678 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bShowHUDTargetExtraInfo : 1;                    		// 0x0678 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bRotatingRadarMap : 1;                          		// 0x0678 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_bFadeOutHitEffect : 1;                          		// 0x0678 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_bEnableHitEffect : 1;                           		// 0x0678 (0x0004) [0x0000000000044000] [0x00000040] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      m_bFadeOutZoomEffect : 1;                         		// 0x0678 (0x0004) [0x0000000000000000] [0x00000080] 
	class UDOFAndBloomEffect*                          m_HitBlurEffect;                                  		// 0x067C (0x0004) [0x0000000000000000]              
	class UMaterialEffect*                             m_HitMaterialEffect;                              		// 0x0680 (0x0004) [0x0000000000000000]              
	struct FName                                       c_CurrentScopeMaterialName;                       		// 0x0684 (0x0008) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_HitEffectMaterialInstance;                      		// 0x068C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              m_HitEffectFadeTime;                              		// 0x0690 (0x0004) [0x0000000000000000]              
	float                                              m_MaxHitEffectIntensity;                          		// 0x0694 (0x0004) [0x0000000000000000]              
	struct FLinearColor                                m_MaxHitEffectColor;                              		// 0x0698 (0x0010) [0x0000000000000000]              
	class UMaterialEffect*                             m_SniperZoomEffect;                               		// 0x06A8 (0x0004) [0x0000000000000000]              
	class UDOFAndBloomEffect*                          m_ZoomBlurEffect;                                 		// 0x06AC (0x0004) [0x0000000000000000]              
	float                                              m_ZoomEffectFadeTime;                             		// 0x06B0 (0x0004) [0x0000000000000000]              
	float                                              m_CurrentZoomFOV;                                 		// 0x06B4 (0x0004) [0x0000000000000000]              
	float                                              m_EndZoomFOV;                                     		// 0x06B8 (0x0004) [0x0000000000000000]              
	float                                              m_StartZoomFOV;                                   		// 0x06BC (0x0004) [0x0000000000000000]              
	class UTgUISceneManager*                           m_UISceneManager;                                 		// 0x06C0 (0x0004) [0x0000000000000000]              
	class UTgUIPrimaryHUD*                             m_PrimaryHUD;                                     		// 0x06C4 (0x0004) [0x0000000000000000]              
	class UTgUISettingsMenu_Controls*                  m_KeyBindMenu;                                    		// 0x06C8 (0x0004) [0x0000000000000000]              
	class UTgUIMainMenu*                               m_MainMenu;                                       		// 0x06CC (0x0004) [0x0000000000000000]              
	class UTgUIReceivedItemScreen*                     m_RewardScreen;                                   		// 0x06D0 (0x0004) [0x0000000000000000]              
	class UTgUICampaignMenu_HexMap*                    m_CampaignScreen;                                 		// 0x06D4 (0x0004) [0x0000000000000000]              
	class UTgUIAgencyMenu_Facilities*                  m_FacilitiesScreen;                               		// 0x06D8 (0x0004) [0x0000000000000000]              
	class UMaterialEffect*                             m_BinocularZoomMaterialEffect;                    		// 0x06DC (0x0004) [0x0000000000000000]              
	class UTgUIMissionScene*                           m_MissionScene;                                   		// 0x06E0 (0x0004) [0x0000000000000000]              
	class UTgUIMissionScene_Zone*                      m_ZoneMissionScene;                               		// 0x06E4 (0x0004) [0x0000000000000000]              
	class UTgUIAgentProfile_Equip*                     m_AgentEquipScene;                                		// 0x06E8 (0x0004) [0x0000000000000000]              
	class UTgAgencyData*                               m_AgencyData;                                     		// 0x06EC (0x0004) [0x0000000000000000]              
	class UTgAllianceData*                             m_AllianceData;                                   		// 0x06F0 (0x0004) [0x0000000000000000]              
	class UTgAchievementData*                          m_AchievementData;                                		// 0x06F4 (0x0004) [0x0000000000000000]              
	class UTgAttentionData*                            m_AttentionData;                                  		// 0x06F8 (0x0004) [0x0000000000000000]              
	TArray< int >                                      m_RecentAchievements;                             		// 0x06FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UMaterialInstanceConstant*                   m_ZoomEffectMaterialInstance;                     		// 0x0708 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FDamageDirectionInfo >              c_DamageDirectionData;                            		// 0x070C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                c_MaxNumOfDamgeDirectionIndicators;               		// 0x0718 (0x0004) [0x0000000000000000]              
	class UMaterial*                                   c_DamageDirectionParentMaterial;                  		// 0x071C (0x0004) [0x0000000000000000]              
	float                                              c_DamageDirectionFadeTime;                        		// 0x0720 (0x0004) [0x0000000000000000]              
	struct FName                                       c_DamageDirectionPositionalParamName;             		// 0x0724 (0x0008) [0x0000000000000000]              
	float                                              c_DamageDirectionDamageAmount;                    		// 0x072C (0x0004) [0x0000000000000000]              
	struct FName                                       c_DamageDirectionDamageAmountName;                		// 0x0730 (0x0008) [0x0000000000000000]              
	struct FName                                       c_DamageDirectionFadeParamName;                   		// 0x0738 (0x0008) [0x0000000000000000]              
	struct FName                                       c_DamageStateName;                                		// 0x0740 (0x0008) [0x0000000000000000]              
	float                                              c_ResolutionScale;                                		// 0x0748 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_BodyUnderAttackData;                            		// 0x074C (0x0018) [0x0000000000000000]              
	class UMaterial*                                   c_BodyUnderAttackParentMaterial;                  		// 0x0764 (0x0004) [0x0000000000000000]              
	float                                              c_BodyUnderAttackFadeTime;                        		// 0x0768 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_BeingLockedData;                                		// 0x076C (0x0018) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   c_BeingLockedParentMaterial;                      		// 0x0784 (0x0004) [0x0000000000000000]              
	float                                              c_BeingLockedFadeTime;                            		// 0x0788 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_BeingTargetedData;                              		// 0x078C (0x0018) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   c_BeingTargetedParentMaterial;                    		// 0x07A4 (0x0004) [0x0000000000000000]              
	float                                              c_BeingTargetedFadeTime;                          		// 0x07A8 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_BeingDetectedData;                              		// 0x07AC (0x0018) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   c_BeingDetectedParentMaterial;                    		// 0x07C4 (0x0004) [0x0000000000000000]              
	float                                              c_BeingDetectedFadeTime;                          		// 0x07C8 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_ActiveCombatData;                               		// 0x07CC (0x0018) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   c_ActiveCombatParentMaterial;                     		// 0x07E4 (0x0004) [0x0000000000000000]              
	float                                              c_ActiveCombatFadeTime;                           		// 0x07E8 (0x0004) [0x0000000000000000]              
	struct FDamageDirectionInfo                        c_InBombRangeData;                                		// 0x07EC (0x0018) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   c_InBombRangeParentMaterial;                      		// 0x0804 (0x0004) [0x0000000000000000]              
	float                                              c_InBombRangeFadeTime;                            		// 0x0808 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   c_RemainingShiftingReticuleDistance;              		// 0x080C (0x0008) [0x0000000000000000]              
	struct FVector2D                                   c_CurrentReticulePos;                             		// 0x0814 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   c_DestinationReticulePos;                         		// 0x081C (0x0008) [0x0000000000000000]              
	float                                              c_ShiftingReticuleSpeed;                          		// 0x0824 (0x0004) [0x0000000000000000]              
	class UTgStatsData*                                c_StatsData;                                      		// 0x0828 (0x0004) [0x0000000000000000]              
	class UTgVoiceMacroTree*                           c_VoiceMacroTree;                                 		// 0x082C (0x0004) [0x0000000000000000]              
	class AActor*                                      c_SceneTriggerActor;                              		// 0x0830 (0x0004) [0x0000000000000000]              
	struct FVector                                     m_vWorldMouseLocation;                            		// 0x0834 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vWorldMouseDirection;                           		// 0x0840 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vMouseHoverLocation;                            		// 0x084C (0x000C) [0x0000000000000000]              
	struct FVector                                     m_vMouseHitNormal;                                		// 0x0858 (0x000C) [0x0000000000000000]              
	TArray< struct FPointer >                          RewardQueue;                                      		// 0x0864 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UTgUIChat*                                   m_ChatUI;                                         		// 0x0870 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   m_AcceptQuestCue;                                 		// 0x0874 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   m_TurninQuestCue;                                 		// 0x0878 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   m_AbandonQuestCue;                                		// 0x087C (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_QuestHUDTagMIC;                                 		// 0x0880 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_CompleteQuestHUDTagMIC;                         		// 0x0884 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_QuestOffscreenTagMIC;                           		// 0x0888 (0x0004) [0x0000000000000000]              
	float                                              m_fLastQuestHUDOpacity[ 0x2 ];                    		// 0x088C (0x0008) [0x0000000000000000]              
	struct FString                                     m_CachedMapnameString;                            		// 0x0894 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           m_endKismetEvents;                                		// 0x08A0 (0x000C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	TArray< int >                                      m_runOnceBilboards;                               		// 0x08AC (0x000C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	int                                                m_RequestingVendorScene;                          		// 0x08B8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1596 ];

		return pClassPointer;
	};

	void ShowPathToAttentionPOI ( );
	void StartVoiceMacroTree ( );
	void eventClearTriggeredSceneInfo ( );
	void eventSetTriggeredSceneInfo ( class AActor* triggerActor );
	void CycleTrackedAssignment ( );
	void ShowDevNotes ( );
	void BrowseToDevNotes ( );
	void UpdateReleaseTime ( float fReleaseTime );
	class UTgUIReleaseMenus* GetActiveReleaseMenu ( );
	void ShowReleaseDialog ( unsigned long bShow, struct FDeathZoomInfo Info, float fReleaseTime, unsigned long bCanManuallyRelease );
	class UTgUISceneDriver* ShowDevSpawnBotMenu ( );
	void ForceUpdateDeviceBar ( int nActiveDeviceId );
	void HideWorldInteractionText ( );
	void ShowWorldInteractionTextById ( int nMsgId );
	void ShowWorldInteractionText ( struct FString sMsg );
	void HideProgressBar ( unsigned long bWorldInteractionBar );
	void StartProgressBar ( float fDuration, struct FString sLabel, unsigned long bWorldInteractionBar );
	void DisplayBadConnectionAlert ( );
	void HideTaskForce ( );
	void ShowTaskForce ( );
	void SetReticuleVisibility ( unsigned long bCrossHairVisible, unsigned long bWeaponStatusVisible );
	void eventTick ( float DeltaTime );
	void NativeTick ( float DeltaTime );
	void PlayZoomBlur ( );
	void PlayZoomEffect ( unsigned long bEnable, unsigned char ZoomType );
	class UMaterialInstanceConstant* GetZoomEffectByAspectRatio ( );
	void SetZoomScope ( struct FName ScopeName );
	void DisplayDamage ( );
	void UpdateDamage ( );
	float CalcHitDirection ( struct FVector HitDir );
	void PlayHitEffect ( float Damage, struct FVector HitDir );
	void RadarMapRotates ( unsigned long RotatingMapStyle );
	void LogBreak ( int I );
	bool SelectPreviousDevice ( );
	bool SelectNextDevice ( );
	void UpdateSelectedDevice ( class ATgDevice* Dev );
	bool UsePickupDevice ( );
	bool SelectDeviceBarType ( unsigned char eType );
	bool SelectDeviceBarSlot ( int Slot );
	void ToggleDrawAllHUD ( );
	void ToggleDrawPawnHUD ( );
	bool ShouldDrawPawnHUD ( );
	void ToggleTargetExtraInfo ( );
	void eventShowRaidTab ( int nTab );
	void eventCheckLevelUnlocks ( unsigned long bIsTutorial );
	class UUIScene* eventOpenIntroScene ( float FadeTime, float TotalTime );
	void TgFxLightsOn ( unsigned long bOn );
	void OpenDevMenu ( );
	void LiveTeamPerfStats ( );
	bool IsForValidPlayer ( );
	void eventShowEndRaidScreen ( unsigned long bAttackerWon );
	void ShowQuestEndMissionScene ( unsigned long MissionVictor, unsigned long PlayerVictor, unsigned long bTie );
	void ShowEndMissionScreen ( unsigned long MissionVictor, unsigned long PlayerVictor, unsigned long bTie );
	void UpdateScoreBoard ( unsigned long bPlayerVictor, unsigned long bTie );
	void eventCloseConfirmPopup ( class UFunction* callbackPtr, unsigned long bTellGameClient );
	void eventCreateConfirmPopup ( struct FString Message, class UFunction* callbackPtr );
	class UTgUIPreviewScreen* eventViewItemPreview ( class UTgInventoryObject* Item );
	class UTgUISceneDriver* ToggleMainMenuScreen ( );
	void OpenSkillScreen ( );
	void OpenInventoryLog ( );
	void OpenItemModScreen ( );
	void OpenAgentScreen ( unsigned long bIsTutorial );
	void ShowGametypeInfo ( );
	void OpenLFGScreen ( );
	void OpenZoneMissions ( );
	void OpenAgencyDirectory ( );
	void OpenMailScreen ( );
	void OpenAuctionScreen ( );
	bool eventMainMenuDisplayed ( );
	void eventOpenPlayerSearchPrepopulatedById ( int nPlayerId );
	void eventOpenPlayerSearchPrepopulated ( struct FString sPlayerName, struct FString sAgencyName, struct FString sAllianceName );
	class UTgUISceneDriver* eventSelectAgentTab ( unsigned char Tab, class ATgPawn_Character* InspectedPawn );
	void eventSelectAgencyTab ( unsigned char Tab );
	void ZoneMap ( );
	void MissionLog ( );
	void OpenAgencyMenu ( );
	void OpenNavScreen ( );
	void OpenCharacterSkillScreen ( );
	void OpenCharacterStatsScreen ( );
	void OpenTeamDetailScreen ( );
	void OpenInventoryScreen ( );
	void OpenInstanceSelect ( );
	void OpenAchievementsNew ( );
	class UTgUIProductionPopup* eventOpenProductionPopup ( class UTgUISceneDriver* ParentScene );
	class UTgUIInventoryPopup* eventOpenFilteredInventoryPopup ( class UTgUISceneDriver* ParentScene );
	void OpenHexAuction ( int nHexId );
	void eventSelectCampaignTab ( unsigned char Tab );
	void OpenCombatAlerts ( );
	void OpenHexMap ( );
	void OpenHexLeaderboard ( );
	void TestSetHexBackground ( int nResourceId );
	void ShowDeviceBarHUD ( unsigned long Show );
	struct FName GetInputKeyForCommand ( class UPlayerInput* Input, struct FString CommandName );
	struct FString HUDLocalGetBind ( class UPlayerInput* Input, struct FName BindName );
	float eventGetAmountCurrentlyOffOfTargetAccuracy ( );
	float eventGetCurrentDeviceAccuracy ( );
	struct FString FormatTime ( );
	float ScaleY ( float Y );
	float ScaleX ( float X );
	bool InRange ( float X, float lower, float upper );
	void SizeInt ( int Value, float Scale, float* XL, float* YL );
	void DrawInt ( int Value, float X, float Y, float Scale );
	void DrawSpectatorHud ( );
	void DrawTargetText ( struct FString Str );
	void DrawHoverText ( struct FString Str );
	void DrawHealth ( );
	void DrawTextPanel ( );
	void AddNewDisplayMessage ( struct FString sMessage );
	void AddNewKilledTarget ( struct FString KilledName, struct FString KillerName, unsigned long KillerWasPlayer );
	void AddConsoleMessage ( struct FString M, class UClass* InMessageClass, class APlayerReplicationInfo* PRI, float Lifetime );
	void DisplayConsoleMessages ( );
	void eventCloseGUIItems ( );
	void eventOpenGUIItems ( );
	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
	void CancelActiveCombat ( );
	void DisplayActiveCombat ( int nStateParam );
	void CancelBeingDetected ( );
	void DisplayBeingDetected ( int nStateParam );
	void CancelBeingTargeted ( );
	void DisplayBeingTargeted ( );
	void CancelInBombRange ( );
	void DisplayInBombRange ( );
	void CancelBeingLocked ( );
	void DisplayBeingLocked ( );
	void CancelBodyUnderAttack ( );
	void DisplayBodyUnderAttack ( int Damage );
	void DisplayHit ( struct FVector HitDir, int Damage, class UClass* DamageType );
	void eventPostRender ( );
	void PostRenderScenes ( );
	void PostRenderSceneTooltips ( );
	class UObject* GetTgUISceneDriver ( class UUIScene* Scene );
	bool TriggerCloseTgUIScene ( class UUIScene* Scene );
	class UUIScene* TriggerOpenTgUIScene ( class UUIScene* Scene );
	void InitializeTgUIScenes ( );
	void PostBeginPlay ( );
	void DrawCommandInfo ( class ATgPlayerController* PC );
	void DrawHUD ( );
	class UTgGameViewportClient* GetTgGameViewportClient ( );
	struct FVector GetMouseHitNormal ( );
	struct FVector GetMouseHoverLocation ( );
	void TestAgencyRemoveItem ( int nInvId, int nInstanceCount, int nItemId );
	void TestAgencyAddItem ( int nInvId, int nInstanceCount );
	void TestAgencyUpdateCurrency ( int nCurrencyChange );
	void TestStrikeForceRemoveItem ( int nInvId, int nInstanceCount, int nTaskTeam );
	void TestStrikeForceAddItem ( int nInvId, int nItemId, int nInstanceCount, int nTaskTeam );
	void TestRemoveFactoryItem ( int nZoneObjectId, int nPosition, int nQueueId, int nCount );
	void TestAddFactoryItem ( int nZoneObjectId, int nPosition, int nInvId, int nCount );
	void TestAddFacility ( int nZoneObjectId, int nPosition, int nInvId );
	void CheckStorePrompt ( );
	void InitQuestVisuals ( );
	void ClientTestAgencyUpdateCurrency ( int nCurrencyChange );
	void ClientTestAgencyRemoveItem ( int nInvId, int nInstanceCount, int nItemId );
	void ClientTestAgencyAddItem ( int nInvId, int nInstanceCount );
	void ClientTestRemoveFactoryItem ( int nZoneObjectId, int nPosition, int nQueueId, int nCount );
	void ClientTestAddFactoryItem ( int nZoneObjectId, int nPosition, int nInvId, int nCount );
	void ClientTestAddFacility ( int nZoneObjectId, int nPosition, int nInvId );
	void ClientTestStrikeForceRemoveItem ( int nInvId, int nInstanceCount, int nTaskTeam );
	void ClientTestStrikeForceAddItem ( int nInvId, int nItemId, int nInstanceCount, int nTaskTeam );
	void UpdateRangedTargeterState ( unsigned char eNewState );
	void UpdateMouseVector ( );
	void RevealHiddenRewardScreen ( );
	void DismissRewardScreen ( );
	void SetRewardScreenReveal ( float fSeconds );
	void SetRewardScreenAutoDismiss ( float fSeconds );
	bool IsRewardScreenOpen ( );
	void OpenNextRewardScreen ( );
	bool GetControllerAndViewport ( class ATgPlayerController** pController, class UTgGameViewportClient** pViewport );
	class UTgUIMapTransition* GetMapTransition ( );
	void ToggleMapNameDisplay ( );
	void SetDepthTestingEnabled ( class UCanvas* pCanvas, unsigned long bEnable );
	void DrawObjectiveOverlays ( struct FVector CameraPosition, struct FVector CameraDir );
	void DrawActorOverlays ( );
	void ResubmitPopups ( );
	bool CheckShouldSkipEndMission ( );
	bool HideObjectiveNames ( );
	bool HideObjectives ( );
	bool HideEnemyTags ( );
	bool ShowCombatText ( );
	bool ShowDeployableHealthBars ( );
	bool CheckDisableWorldRendering ( );
	void OpenTeamScreen ( );
	class UTgUISceneDriver* OpenManagedSceneByID ( unsigned char funcID );
	class UTgUISceneDriver* ToggleManagedSceneByID ( unsigned char funcID, unsigned long bOpenedFromUIVolume );
	class UTgUISceneDriver* ToggleManagedScene ( struct FName ClassName, unsigned long bOpenedFromUIVolume );
	void ChatCycleTab ( unsigned long Increment );
	void ChatOpacity ( float ChatOpacityIn );
	void ChatEnd ( );
	void ChatPageDown ( unsigned long Active );
	void ChatPageUp ( unsigned long Active );
	void ChatToggleMode ( );
	void ChatToggleOnTop ( );
	void ChatStartReply ( );
	void ChatStartSlash ( );
	void ChatStartDefault ( );
	void FreemouseOnHUD ( unsigned long bFree );
	void GetStringDimensions ( class UFont* fontToUse, struct FString checkString, int* StringWidth, int* StringHeight );
	void UpdateUITextBox ( unsigned char TextBoxBitfield, float Duration, int messageID );
	void UpdateUITimer ( unsigned char ClockStateBitfield, float TimerDuration );
	void InitializeVoiceMacroTree ( );
	void InitializeCommonDataStores ( );
	void NativePostBeginPlay ( );
	void UseCrosshairForReticule ( struct FName CrosshairName );
	void ResetDeviceHudTimersUI ( int DeviceEqpPoint );
	void UpdateInHandDevicesUI ( class ATgDevice* pDevice );
	void UpdateHiddenDevicesUI ( );
	void UpdateDeviceBarUIItems ( );
	void UpdateModeEquipTimer ( int nIsActive, float fEquipTime );
	void UpdateDeviceSlotTimers ( int nDeviceInstanceId, int nDeviceMode, float fSetup, float fRecharge, float fElaspedCooldown );
	void TriggerDeviceRefresh ( );
};

UClass* ATgHUD_Game::pClassPointer = NULL;

// Class TgClient.TgLoginHUD
// 0x0028 (0x05C4 - 0x059C)
class ATgLoginHUD : public ATgHUD
{
public:
	class UTgUISceneManager*                           m_UISceneManager;                                 		// 0x059C (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bCreateCharacterTriggered : 1;                  		// 0x05A0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bPlayTutorial : 1;                              		// 0x05A0 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bTutorialMoviePlayed : 1;                       		// 0x05A0 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                m_nClassToCreate;                                 		// 0x05A4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_nmPreplayMovie;                                 		// 0x05A8 (0x0008) [0x0000000000000000]              
	class UTgDataSet*                                  c_DataSet;                                        		// 0x05B0 (0x0004) [0x0000000000000000]              
	class UTgDataInterface*                            c_DataInterface;                                  		// 0x05B4 (0x0004) [0x0000000000000000]              
	class AInterpActor*                                m_CachedEarthModel;                               		// 0x05B8 (0x0004) [0x0000000000000000]              
	class UTgUILoginMenu*                              m_LoginMenu;                                      		// 0x05BC (0x0004) [0x0000000000000000]              
	int                                                m_nNumCharacters;                                 		// 0x05C0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1597 ];

		return pClassPointer;
	};

	void ShowDevNotes ( );
	void BrowseToDevNotes ( );
	void eventBackToLogin ( );
	void eventSendCharCreateErrorCode ( int ErrorCode );
	void eventCreateCharacter ( );
	void ConditionalSetTutorialFlag ( );
	class UTgUIClassSelectScene* LoadClassSelect ( );
	class UTgUICustomHeadMenu* LoadCustomHeadMenu ( );
	class UTgUICreateCharA* LoadCharCreateMenu ( );
	void eventTick ( float DeltaTime );
	void NativeTick ( float DeltaTime );
	void InitializeDataInterface ( );
	void OpenMenu ( );
	void PostBeginPlay ( );
	void SetMatineeCamToLogin ( unsigned long bSetToLogin );
	void LoadCharacterSelectMenu ( unsigned long bError );
	void LoadLoginMenu ( );
	void InitializeTgUIScenes ( );
	class AInterpActor* GetEarthModel ( );
	class ATgSkeletalMeshActor_CharacterBuilder* GetCharacterBuilderSkelMeshActor ( );
	void GetCharMorphSettings ( struct FCharacterInfoStruct* CharInfo );
	class UTgUIMapTransition* GetMapTransition ( );
	void AddPlayerCharacterCallback ( int eType );
};

UClass* ATgLoginHUD::pClassPointer = NULL;

// Class TgClient.TgLoginInfo
// 0x0004 (0x03AC - 0x03A8)
class ATgLoginInfo : public AGameInfo
{
public:
	class UTgDebug*                                    m_DebugSettings;                                  		// 0x03A8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1598 ];

		return pClassPointer;
	};

	void PostBeginPlay ( );
	bool ShouldSkipLoginHUD ( );
	bool HasSelectedCharacter ( );
	bool IsInGame ( );
	bool IsLoggedIn ( );
	void CreateDebugStructure ( );
};

UClass* ATgLoginInfo::pClassPointer = NULL;

// Class TgClient.TgLoginPlayerController
// 0x0000 (0x0920 - 0x0920)
class ATgLoginPlayerController : public ATgPlayerController
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1599 ];

		return pClassPointer;
	};

	void StopAltFire ( unsigned char FireModeNum );
	void StartAltFire ( unsigned char FireModeNum );
	void StartFire ( );
	void NextWeapon ( );
	void PrevWeapon ( );
	void PostBeginPlay ( );
	bool CheckAutoLogin ( );
};

UClass* ATgLoginPlayerController::pClassPointer = NULL;

// Class TgClient.TgStatsData
// 0x0A78 (0x0AB4 - 0x003C)
class UTgStatsData : public UObject
{
public:
	unsigned long                                      m_bGameOver : 1;                                  		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	struct FScores                                     m_ScoreArray[ 0x18 ];                             		// 0x0040 (0x0A20) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_RankArray[ 0xA ];                               		// 0x0A60 (0x0028) [0x0000000000000000]              
	int                                                m_HighScoreArray[ 0x8 ];                          		// 0x0A88 (0x0020) [0x0000000000000000]              
	int                                                m_nPlayerCount;                                   		// 0x0AA8 (0x0004) [0x0000000000000000]              
	float                                              m_fLastCopy;                                      		// 0x0AAC (0x0004) [0x0000000000000000]              
	class ATgHUD_Game*                                 m_HUD;                                            		// 0x0AB0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1600 ];

		return pClassPointer;
	};

	void eventInit ( class ATgHUD_Game* HUD );
	int GetPlayerCount ( );
	class ATgRepInfo_Player* GetMyPRI ( );
	void PopulatePlayerRankArray ( );
	int GetBestPlayerRankIndex ( );
	void SortScores ( int eSortField );
	void CopyScores ( );
	void SetGameOver ( unsigned long bGameover, unsigned long bPlayerVictor );
};

UClass* UTgStatsData::pClassPointer = NULL;

// Class TgClient.TgUILevelMap
// 0x01C0 (0x01FC - 0x003C)
class UTgUILevelMap : public UObject
{
public:
	unsigned long                                      m_bInitialized : 1;                               		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bActive : 1;                                    		// 0x003C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bTransitioning : 1;                             		// 0x003C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bRotatePoints : 1;                              		// 0x003C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_DesiredOpacityChange : 1;                       		// 0x003C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_DesiredOpacityIncrease : 1;                     		// 0x003C (0x0004) [0x0000000000000000] [0x00000020] 
	float                                              m_TimeOfTick;                                     		// 0x0040 (0x0004) [0x0000000000000000]              
	class ATgHUD_Game*                                 m_HUDParent;                                      		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FVector                                     m_Location;                                       		// 0x0048 (0x000C) [0x0000000000000000]              
	struct FRotator                                    m_Rotation;                                       		// 0x0054 (0x000C) [0x0000000000000000]              
	float                                              m_fZoomBase;                                      		// 0x0060 (0x0004) [0x0000000000000000]              
	float                                              m_fZoomScale;                                     		// 0x0064 (0x0004) [0x0000000000000000]              
	float                                              m_fOriginalXResolution;                           		// 0x0068 (0x0004) [0x0000000000000000]              
	float                                              m_fOriginalYResolution;                           		// 0x006C (0x0004) [0x0000000000000000]              
	struct FVector                                     m_CurrentMapScale;                                		// 0x0070 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_CurrentMapStart;                                		// 0x007C (0x000C) [0x0000000000000000]              
	int                                                m_LocalPlayerRotation;                            		// 0x0088 (0x0004) [0x0000000000000000]              
	struct FVector                                     m_LocalPlayerLocation;                            		// 0x008C (0x000C) [0x0000000000000000]              
	TArray< struct FsPlayerWidgetData >                m_PlayerWidgetData;                               		// 0x0098 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FsDeployableWidgetData >            m_DeployableWidgetData;                           		// 0x00A4 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FsObjectiveWidgetData >             m_ObjectiveWidgetData;                            		// 0x00B0 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	TArray< struct FsQuestVolumeWidgetData >           m_QuestWidgetData;                                		// 0x00BC (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_DesiredOpacity;                                 		// 0x00C8 (0x0004) [0x0000000000000000]              
	float                                              m_CurrentOpacity;                                 		// 0x00CC (0x0004) [0x0000000000000000]              
	float                                              m_TimeOfRealStart;                                		// 0x00D0 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  m_BlankRadarTexture;                              		// 0x00D4 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconLocalPlayer;                                		// 0x00D8 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconTeamPlayer;                                 		// 0x00DC (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconTeamPlayerBlink;                            		// 0x00E0 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconTeamMedic;                                  		// 0x00E4 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconTeamMedicBlink;                             		// 0x00E8 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconFriendlyPlayer;                             		// 0x00EC (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconFriendlyPlayerBlink;                        		// 0x00F0 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconFriendlyMedic;                              		// 0x00F4 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconFriendlyMedicBlink;                         		// 0x00F8 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconEnemy;                                      		// 0x00FC (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconFriendlyNPC;                                		// 0x0100 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   m_IconSound;                                      		// 0x0104 (0x0004) [0x0000000000000000]              
