/*
#############################################################################################
# Global Agenda (1.5.1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function TgGame.TgAnimNodeBlendByVerticalAim.OnBecomeRelevant
// [0x00020802] ( FUNC_Event )
struct UTgAnimNodeBlendByVerticalAim_eventOnBecomeRelevant_Parms
{
};

// Function TgGame.TgAnimNodeBlendByVerticalAim.PlayAnim
// [0x00024400] ( FUNC_Native )
struct UTgAnimNodeBlendByVerticalAim_execPlayAnim_Parms
{
	unsigned long                                      bLoop : 1;                                        		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              Rate;                                             		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              StartTime;                                        		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgCaptureComponent.ForceFullUpdate
// [0x00020400] ( FUNC_Native )
struct UTgCaptureComponent_execForceFullUpdate_Parms
{
};

// Function TgGame.TgChestActor.ShowMesh
// [0x00020902] ( FUNC_Event )
struct ATgChestActor_eventShowMesh_Parms
{
	// class UMeshComponent*                           ComponentIt;                                      		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function TgGame.TgChestActor.HideMesh
// [0x00020902] ( FUNC_Event )
struct ATgChestActor_eventHideMesh_Parms
{
	// class UMeshComponent*                           ComponentIt;                                      		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function TgGame.TgChestActor.AdjustClientChestState
// [0x00020102] 
struct ATgChestActor_execAdjustClientChestState_Parms
{
};

// Function TgGame.TgChestActor.RemoveUserPrompt
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execRemoveUserPrompt_Parms
{
};

// Function TgGame.TgChestActor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgChestActor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgChestActor.UnTouch
// [0x00020902] ( FUNC_Event )
struct ATgChestActor_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  aPawn;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgChestActor.Touch
// [0x00020902] ( FUNC_Event )
struct ATgChestActor_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  aPawn;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgChestActor.DisplayUseMessage
// [0x00020102] 
struct ATgChestActor_execDisplayUseMessage_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bDisplay : 1;                                     		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class ATgPlayerController*                      tgpc;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgChestActor.OnToggle
// [0x00020102] 
struct ATgChestActor_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgChestActor.PostBeginPlay
// [0x00020102] 
struct ATgChestActor_execPostBeginPlay_Parms
{
};

// Function TgGame.TgChestActor.ForceNetRelevant
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execForceNetRelevant_Parms
{
};

// Function TgGame.TgChestActor.CloseChest
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execCloseChest_Parms
{
};

// Function TgGame.TgChestActor.LootChest
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execLootChest_Parms
{
};

// Function TgGame.TgChestActor.OpenChest
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execOpenChest_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgChestActor.RespawnChest
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execRespawnChest_Parms
{
};

// Function TgGame.TgChestActor.SpawnChest
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execSpawnChest_Parms
{
};

// Function TgGame.TgChestActor.LoadMesh
// [0x00020400] ( FUNC_Native )
struct ATgChestActor_execLoadMesh_Parms
{
};

// Function TgGame.TgCollisionProxy.GetNearByPlayersTaskforce
// [0x00424102] 
struct ATgCollisionProxy_execGetNearByPlayersTaskforce_Parms
{
	TArray< int >                                      NearByPlayerTaskForces;                           		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      bEndWhenMultipleFound : 1;                        		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             nCurrTaskForce;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	// class ATgPawn*                                  P;                                                		// 0x001C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bFound : 1;                                       		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function TgGame.TgCollisionProxy.GetNearByPlayers
// [0x00024102] 
struct ATgCollisionProxy_execGetNearByPlayers_Parms
{
	unsigned long                                      bOnlyValid : 1;                                   		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ATgPawn*                                  P;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             nCount;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy.OnPlayerRemoved
// [0x00020100] 
struct ATgCollisionProxy_execOnPlayerRemoved_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgCollisionProxy.OnPlayerAdded
// [0x00020100] 
struct ATgCollisionProxy_execOnPlayerAdded_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgCollisionProxy.CheckNearByPlayers
// [0x00020102] 
struct ATgCollisionProxy_execCheckNearByPlayers_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAdd : 1;                                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// unsigned long                                   bFound : 1;                                       		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             nLen;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy.ForceClearNearByPlayersList
// [0x00020102] 
struct ATgCollisionProxy_execForceClearNearByPlayersList_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy.ShouldIgnoreActor
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_eventShouldIgnoreActor_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgCollisionProxy.UnTouch
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  aPawn;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy.Touch
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  aPawn;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy_Vortex.OnPlayerRemoved
// [0x00020102] 
struct ATgCollisionProxy_Vortex_execOnPlayerRemoved_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgCollisionProxy_Vortex.OnPlayerAdded
// [0x00020102] 
struct ATgCollisionProxy_Vortex_execOnPlayerAdded_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgCollisionProxy_Vortex.ShouldIgnoreActor
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_Vortex_eventShouldIgnoreActor_Parms
{
	class ATgPawn*                                     aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bIgnore : 1;                                      		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class ATgPawn*                                  pOwner;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgCollisionProxy_Vortex.UnTouch
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_Vortex_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgCollisionProxy_Vortex.Touch
// [0x00020902] ( FUNC_Event )
struct ATgCollisionProxy_Vortex_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDebug.WriteLoginInfo
// [0x00020802] ( FUNC_Event )
struct UTgDebug_eventWriteLoginInfo_Parms
{
	struct FString                                     NameString;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Password;                                         		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgGame.TgDoor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgDoor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDoor.UpdateState
// [0x00020902] ( FUNC_Event )
struct ATgDoor_eventUpdateState_Parms
{
	unsigned long                                      bOpen : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgDoor.OnToggle
// [0x00020102] 
struct ATgDoor_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDoor.PostBeginPlay
// [0x00020102] 
struct ATgDoor_execPostBeginPlay_Parms
{
};

// Function TgGame.TgDoor.UpdateMICs
// [0x00020400] ( FUNC_Native )
struct ATgDoor_execUpdateMICs_Parms
{
};

// Function TgGame.TgDoor.BuildDoor
// [0x00020400] ( FUNC_Native )
struct ATgDoor_execBuildDoor_Parms
{
};

// Function TgGame.TgDynamicSMActor.CanApplyEffects
// [0x00020002] 
struct ATgDynamicSMActor_execCanApplyEffects_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgDynamicSMActor.Detach
// [0x00020002] 
struct ATgDynamicSMActor_execDetach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.Attach
// [0x00020002] 
struct ATgDynamicSMActor_execAttach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.HideMesh
// [0x00020102] 
struct ATgDynamicSMActor_execHideMesh_Parms
{
	// class UMeshComponent*                           ComponentIt;                                      		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function TgGame.TgDynamicSMActor.DrawHealth
// [0x00820102] 
struct ATgDynamicSMActor_execDrawHealth_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// float                                           YL;                                               		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           HealthX;                                          		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           HealthY;                                          		// 0x0028 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ScreenLoc;                                        		// 0x002C (0x000C) [0x0000000000000000]              
	// float                                           ScaleFactor;                                      		// 0x0038 (0x0004) [0x0000000000000000]              
	// struct FVector                                  CamLocation;                                      		// 0x003C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CamRotation;                                      		// 0x0048 (0x000C) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x0054 (0x0004) [0x0000000000000000]              
	// float                                           closeDist;                                        		// 0x0058 (0x0004) [0x0000000000000000]              
	// float                                           FOVAngle;                                         		// 0x005C (0x0004) [0x0000000000000000]              
	// float                                           stdFOV;                                           		// 0x0060 (0x0004) [0x0000000000000000]              
	// float                                           scaleMax;                                         		// 0x0064 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgDynamicSMActor.GetSize
// [0x00820102] 
struct ATgDynamicSMActor_execGetSize_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FBox                                     Bounding;                                         		// 0x0004 (0x001C) [0x0000000000000000]              
	// float                                           fSize;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgDynamicSMActor.ProcessEffect
// [0x00024102] 
struct ATgDynamicSMActor_execProcessEffect_Parms
{
	class UTgEffectGroup*                              Effect;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bRemove : 1;                                      		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	class AActor*                                      aInstigator;                                      		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FImpactInfo                                 Impact;                                           		// 0x000C (0x0060) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.PlaySpecialFx
// [0x00020102] 
struct ATgDynamicSMActor_execPlaySpecialFx_Parms
{
	struct FName                                       nDisplayMode;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.Destroyed
// [0x00020102] 
struct ATgDynamicSMActor_execDestroyed_Parms
{
};

// Function TgGame.TgDynamicSMActor.DestroyIt
// [0x00024102] 
struct ATgDynamicSMActor_execDestroyIt_Parms
{
	unsigned long                                      bSkipFx : 1;                                      		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.TakeDamage
// [0x00024802] ( FUNC_Event )
struct ATgDynamicSMActor_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 EventInstigator;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgDynamicSMActor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.PostBeginPlay
// [0x00020102] 
struct ATgDynamicSMActor_execPostBeginPlay_Parms
{
	// unsigned long                                   bEnableLE : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function TgGame.TgDynamicSMActor.Tick
// [0x00020802] ( FUNC_Event )
struct ATgDynamicSMActor_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicSMActor.ForceNetRelevant
// [0x00020400] ( FUNC_Native )
struct ATgDynamicSMActor_execForceNetRelevant_Parms
{
};

// Function TgGame.TgDynamicSMActor.SwapMeshToDestroyed
// [0x00020400] ( FUNC_Native )
struct ATgDynamicSMActor_execSwapMeshToDestroyed_Parms
{
};

// Function TgGame.TgDynamicSMActor.LoadMesh
// [0x00020400] ( FUNC_Native )
struct ATgDynamicSMActor_execLoadMesh_Parms
{
};

// Function TgGame.TgDynamicDestructible.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgDynamicDestructible_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgDynamicDestructible.InitializeById
// [0x00020400] ( FUNC_Native )
struct ATgDynamicDestructible_execInitializeById_Parms
{
	int                                                nDestructibleId;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgFlagCaptureVolume.GetDisplayLocation
// [0x00020102] 
struct ATgFlagCaptureVolume_execGetDisplayLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgFlagCaptureVolume.CanCapture
// [0x00020102] 
struct ATgFlagCaptureVolume_execCanCapture_Parms
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ATgRepInfo_Player*                        pawnInfo;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgFlagCaptureVolume.Touch
// [0x00020902] ( FUNC_Event )
struct ATgFlagCaptureVolume_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class ATgPawn*                                  toCheck;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	// class ATgRepInfo_Game*                          GRI;                                              		// 0x0024 (0x0004) [0x0000000000000000]              
	// class ATgMissionObjective*                      Objective;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
	// class ATgBaseObjective_CTFBot*                  ctfbotobjective;                                  		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function TgGame.TgFlagCaptureVolume.PreBeginPlay
// [0x00020002] 
struct ATgFlagCaptureVolume_execPreBeginPlay_Parms
{
};

// Function TgGame.TgFlagCaptureVolume.setupFlagCapVolume
// [0x00020400] ( FUNC_Native )
struct ATgFlagCaptureVolume_execsetupFlagCapVolume_Parms
{
};

// Function TgGame.TgFracturedStaticMeshActor.ProcessEffect
// [0x00024102] 
struct ATgFracturedStaticMeshActor_execProcessEffect_Parms
{
	class UTgEffectGroup*                              Effect;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bRemove : 1;                                      		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	class AActor*                                      aInstigator;                                      		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FImpactInfo                                 Impact;                                           		// 0x000C (0x0060) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgFracturedStaticMeshActor.TakeDamage
// [0x00024902] ( FUNC_Event )
struct ATgFracturedStaticMeshActor_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 EventInstigator;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgFracturedStaticMeshActor.CanApplyEffects
// [0x00020002] 
struct ATgFracturedStaticMeshActor_execCanApplyEffects_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgFracturedStaticMeshActor.Destroyed
// [0x00020102] 
struct ATgFracturedStaticMeshActor_execDestroyed_Parms
{
};

// Function TgGame.TgFracturedStaticMeshActor.PostBeginPlay
// [0x00020102] 
struct ATgFracturedStaticMeshActor_execPostBeginPlay_Parms
{
};

// Function TgGame.TgFracturedStaticMeshActor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgFracturedStaticMeshActor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHexLandMarkActor.HideMesh
// [0x00020102] 
struct ATgHexLandMarkActor_execHideMesh_Parms
{
	// class UMeshComponent*                           ComponentIt;                                      		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function TgGame.TgHexLandMarkActor.Destroyed
// [0x00020102] 
struct ATgHexLandMarkActor_execDestroyed_Parms
{
};

// Function TgGame.TgHexLandMarkActor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgHexLandMarkActor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHexLandMarkActor.PostBeginPlay
// [0x00020102] 
struct ATgHexLandMarkActor_execPostBeginPlay_Parms
{
};

// Function TgGame.TgHexLandMarkActor.LoadMesh
// [0x00020400] ( FUNC_Native )
struct ATgHexLandMarkActor_execLoadMesh_Parms
{
};

// Function TgGame.TgHUD.CheckLevelUnlocks
// [0x00020800] ( FUNC_Event )
struct ATgHUD_eventCheckLevelUnlocks_Parms
{
	unsigned long                                      bIsTutorial : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.OpenIntroScene
// [0x00024800] ( FUNC_Event )
struct ATgHUD_eventOpenIntroScene_Parms
{
	float                                              FadeTime;                                         		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              TotalTime;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UUIScene*                                    ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.ClearTriggeredSceneInfo
// [0x00020800] ( FUNC_Event )
struct ATgHUD_eventClearTriggeredSceneInfo_Parms
{
};

// Function TgGame.TgHUD.SetTriggeredSceneInfo
// [0x00020800] ( FUNC_Event )
struct ATgHUD_eventSetTriggeredSceneInfo_Parms
{
	class AActor*                                      triggeredActor;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UpdateScoreBoard
// [0x00020000] 
struct ATgHUD_execUpdateScoreBoard_Parms
{
	unsigned long                                      bPlayerVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.ShowEndRaidScreen
// [0x00020800] ( FUNC_Event )
struct ATgHUD_eventShowEndRaidScreen_Parms
{
	unsigned long                                      bAttackerWon : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.ShowEndTrainingMissionScreen
// [0x00020000] 
struct ATgHUD_execShowEndTrainingMissionScreen_Parms
{
	struct FTG_TRAINING_END_INFO                       endInfo;                                          		// 0x0000 (0x0014) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.ShowQuestEndMissionScene
// [0x00020000] 
struct ATgHUD_execShowQuestEndMissionScene_Parms
{
	unsigned long                                      MissionVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      PlayerVictor : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.ShowEndMissionScreen
// [0x00020000] 
struct ATgHUD_execShowEndMissionScreen_Parms
{
	unsigned long                                      MissionVictor : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      PlayerVictor : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bTie : 1;                                         		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.OpenScoreboard
// [0x00020A00] ( FUNC_Exec | FUNC_Event )
struct ATgHUD_execOpenScoreboard_Parms
{
};

// Function TgGame.TgHUD.ToggleDrawAllHUD
// [0x00020200] ( FUNC_Exec )
struct ATgHUD_execToggleDrawAllHUD_Parms
{
};

// Function TgGame.TgHUD.ToggleDrawPawnHUD
// [0x00020200] ( FUNC_Exec )
struct ATgHUD_execToggleDrawPawnHUD_Parms
{
};

// Function TgGame.TgHUD.ForceUpdateDeviceBar
// [0x00024000] 
struct ATgHUD_execForceUpdateDeviceBar_Parms
{
	int                                                nActiveDeviceId;                                  		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.UpdateReleaseTime
// [0x00024000] 
struct ATgHUD_execUpdateReleaseTime_Parms
{
	float                                              fReleaseTime;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.ShowReleaseDialog
// [0x00024000] 
struct ATgHUD_execShowReleaseDialog_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FDeathZoomInfo                              Info;                                             		// 0x0004 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fReleaseTime;                                     		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bCanManuallyRelease : 1;                          		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.TriggerCloseTgUIScene
// [0x00020802] ( FUNC_Event )
struct ATgHUD_eventTriggerCloseTgUIScene_Parms
{
	class UUIScene*                                    Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.GetTgUISceneDriver
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execGetTgUISceneDriver_Parms
{
	class UUIScene*                                    Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.TriggerOpenTgUIScene
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execTriggerOpenTgUIScene_Parms
{
	class UUIScene*                                    Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UUIScene*                                    ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.IsMissionScene
// [0x00020802] ( FUNC_Event )
struct ATgHUD_eventIsMissionScene_Parms
{
	class UUIScene*                                    Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.HideWorldInteractionText
// [0x00020000] 
struct ATgHUD_execHideWorldInteractionText_Parms
{
};

// Function TgGame.TgHUD.ShowWorldInteractionTextById
// [0x00020000] 
struct ATgHUD_execShowWorldInteractionTextById_Parms
{
	int                                                nMsgId;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.ShowWorldInteractionText
// [0x00020000] 
struct ATgHUD_execShowWorldInteractionText_Parms
{
	struct FString                                     sMsg;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgGame.TgHUD.HideProgressBar
// [0x00024000] 
struct ATgHUD_execHideProgressBar_Parms
{
	unsigned long                                      bWorldInteractionBar : 1;                         		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.StartProgressBar
// [0x00024000] 
struct ATgHUD_execStartProgressBar_Parms
{
	float                                              fDuration;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sLabel;                                           		// 0x0004 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bWorldInteractionBar : 1;                         		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.UpdateSelectedDevice
// [0x00020100] 
struct ATgHUD_execUpdateSelectedDevice_Parms
{
	class ATgDevice*                                   Dev;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UsePickupDevice
// [0x00020202] ( FUNC_Exec )
struct ATgHUD_execUsePickupDevice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.UpdateDeployPointCount
// [0x00020000] 
struct ATgHUD_execUpdateDeployPointCount_Parms
{
};

// Function TgGame.TgHUD.OpenDeployPointMenu
// [0x00020000] 
struct ATgHUD_execOpenDeployPointMenu_Parms
{
};

// Function TgGame.TgHUD.SetReticuleVisibility
// [0x00020000] 
struct ATgHUD_execSetReticuleVisibility_Parms
{
	unsigned long                                      bCrossHairVisible : 1;                            		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bWeaponStatusVisible : 1;                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.HideTaskForce
// [0x00020000] 
struct ATgHUD_execHideTaskForce_Parms
{
};

// Function TgGame.TgHUD.ShowTaskForce
// [0x00020000] 
struct ATgHUD_execShowTaskForce_Parms
{
};

// Function TgGame.TgHUD.ShouldDrawPawnHUD
// [0x00020002] 
struct ATgHUD_execShouldDrawPawnHUD_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.PlayHitEffect
// [0x00020002] 
struct ATgHUD_execPlayHitEffect_Parms
{
	float                                              Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitDir;                                           		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.AddNewDisplayMessage
// [0x00020000] 
struct ATgHUD_execAddNewDisplayMessage_Parms
{
	struct FString                                     sMessage;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function TgGame.TgHUD.AddNewKilledTarget
// [0x00020000] 
struct ATgHUD_execAddNewKilledTarget_Parms
{
	struct FString                                     KilledName;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     KillerName;                                       		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      KillerWasPlayer : 1;                              		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TgGame.TgHUD.CloseGUIItems
// [0x00020802] ( FUNC_Event )
struct ATgHUD_eventCloseGUIItems_Parms
{
};

// Function TgGame.TgHUD.OpenGUIItems
// [0x00020802] ( FUNC_Event )
struct ATgHUD_eventOpenGUIItems_Parms
{
};

// Function TgGame.TgHUD.SetZoomScope
// [0x00020000] 
struct ATgHUD_execSetZoomScope_Parms
{
	struct FName                                       ScopeName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.CancelActiveCombat
// [0x00020000] 
struct ATgHUD_execCancelActiveCombat_Parms
{
};

// Function TgGame.TgHUD.DisplayActiveCombat
// [0x00024000] 
struct ATgHUD_execDisplayActiveCombat_Parms
{
	int                                                nStateParam;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.CancelInBombRange
// [0x00020000] 
struct ATgHUD_execCancelInBombRange_Parms
{
};

// Function TgGame.TgHUD.DisplayInBombRange
// [0x00020000] 
struct ATgHUD_execDisplayInBombRange_Parms
{
};

// Function TgGame.TgHUD.CancelBeingDetected
// [0x00020000] 
struct ATgHUD_execCancelBeingDetected_Parms
{
};

// Function TgGame.TgHUD.DisplayBeingDetected
// [0x00024000] 
struct ATgHUD_execDisplayBeingDetected_Parms
{
	int                                                nStateParam;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.CancelBeingTargeted
// [0x00020000] 
struct ATgHUD_execCancelBeingTargeted_Parms
{
};

// Function TgGame.TgHUD.DisplayBeingTargeted
// [0x00020002] 
struct ATgHUD_execDisplayBeingTargeted_Parms
{
};

// Function TgGame.TgHUD.CancelBeingLocked
// [0x00020000] 
struct ATgHUD_execCancelBeingLocked_Parms
{
};

// Function TgGame.TgHUD.DisplayBeingLocked
// [0x00020002] 
struct ATgHUD_execDisplayBeingLocked_Parms
{
};

// Function TgGame.TgHUD.CancelBodyUnderAttack
// [0x00020000] 
struct ATgHUD_execCancelBodyUnderAttack_Parms
{
};

// Function TgGame.TgHUD.DisplayBodyUnderAttack
// [0x00020002] 
struct ATgHUD_execDisplayBodyUnderAttack_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.DisplayHit
// [0x00020002] 
struct ATgHUD_execDisplayHit_Parms
{
	struct FVector                                     HitDir;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                Damage;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.SetMouseTargetDrawScale
// [0x00020000] 
struct ATgHUD_execSetMouseTargetDrawScale_Parms
{
	float                                              NewScale;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.GetCurrTargetMode
// [0x00020002] 
struct ATgHUD_execGetCurrTargetMode_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.GetMouseHoverActor
// [0x00020002] 
struct ATgHUD_execGetMouseHoverActor_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.GetMouseHitNormal
// [0x00020002] 
struct ATgHUD_execGetMouseHitNormal_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.GetMouseHoverLocation
// [0x00020002] 
struct ATgHUD_execGetMouseHoverLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.SetShowRangeTargeter
// [0x00024000] 
struct ATgHUD_execSetShowRangeTargeter_Parms
{
	unsigned long                                      bInAimingMode : 1;                                		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.CheckShouldSkipEndMission
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execCheckShouldSkipEndMission_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.UpdateRangedTargeterState
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateRangedTargeterState_Parms
{
	unsigned char                                      eNewState;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.ResubmitPopups
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execResubmitPopups_Parms
{
};

// Function TgGame.TgHUD.HideObjectiveNames
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execHideObjectiveNames_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.HideObjectives
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execHideObjectives_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.HideEnemyTags
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execHideEnemyTags_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.ShowCombatText
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execShowCombatText_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.ShowDeployableHealthBars
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execShowDeployableHealthBars_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TgGame.TgHUD.UpdateUITextBox
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateUITextBox_Parms
{
	unsigned char                                      TextBoxBitfield;                                  		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              Duration;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                messageID;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UpdateUITimer
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateUITimer_Parms
{
	unsigned char                                      ClockStateBitfield;                               		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              TimerDuration;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.ResetDeviceHudTimersUI
// [0x00024400] ( FUNC_Native )
struct ATgHUD_execResetDeviceHudTimersUI_Parms
{
	int                                                DeviceEqpPoint;                                   		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgHUD.UpdateDeviceBarUIItems
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateDeviceBarUIItems_Parms
{
};

// Function TgGame.TgHUD.UpdateInHandDevicesUI
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateInHandDevicesUI_Parms
{
	class ATgDevice*                                   pDevice;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UpdateHiddenDevicesUI
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateHiddenDevicesUI_Parms
{
};

// Function TgGame.TgHUD.UpdateMouseTargetMode
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateMouseTargetMode_Parms
{
	unsigned char                                      NewMode;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UseCrosshairForReticule
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUseCrosshairForReticule_Parms
{
	struct FName                                       CrosshairName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.UpdateModeEquipTimer
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execUpdateModeEquipTimer_Parms
{
	int                                                nIsActive;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fEquipTime;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgHUD.TriggerDeviceRefresh
// [0x00020400] ( FUNC_Native )
struct ATgHUD_execTriggerDeviceRefresh_Parms
{
};

// Function TgGame.TgHUD.UpdateDeviceSlotTimers
// [0x00024400] ( FUNC_Native )
struct ATgHUD_execUpdateDeviceSlotTimers_Parms
{
	int                                                nDeviceInstanceId;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nDeviceMode;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fSetup;                                           		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRecharge;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fElaspedCooldown;                                 		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgInterpActor.PlaySpecialFx
// [0x00020102] 
struct ATgInterpActor_execPlaySpecialFx_Parms
{
};

// Function TgGame.TgInterpActor.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATgInterpActor_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgInterpActor.OnTriggerInterpActor
// [0x00020002] 
struct ATgInterpActor_execOnTriggerInterpActor_Parms
{
	class UTgSeqAct_TriggerInterpActor*                Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TgGame.TgInterpActor.PostBeginPlay
// [0x00020102] 
struct ATgInterpActor_execPostBeginPlay_Parms
{
};

// Function TgGame.TgInterpActor.LoadMesh
// [0x00020400] ( FUNC_Native )
struct ATgInterpActor_execLoadMesh_Parms
{
};

// Function TgGame.TgKAsset_ClientSideSim.OnHit
// [0x00024400] ( FUNC_Native )
struct ATgKAsset_ClientSideSim_execOnHit_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      SourceActor;                                      		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x001C (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TgGame.TgManifestGroup.OnAllManifestsLoaded
// [0x00120000] 
struct UTgManifestGroup_execOnAllManifestsLoaded_Parms
{
};

// Function TgGame.TgMeshAssembly.PostBeginPlay
// [0x00020102] 
struct ATgMeshAssembly_execPostBeginPlay_Parms
{
};

// Function TgGame.TgMeshAssembly.ForceNetRelevant
// [0x00020400] ( FUNC_Native )
struct ATgMeshAssembly_execForceNetRelevant_Parms
{
};

// Function TgGame.TgMeshAssembly.LoadMesh
// [0x00020400] ( FUNC_Native )
struct ATgMeshAssembly_execLoadMesh_Parms
{
};

// Function TgGame.TgNewsStand.Destroyed
// [0x00020902] ( FUNC_Event )
struct ATgNewsStand_eventDestroyed_Parms
{
};

// Function TgGame.TgNewsStand.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct ATgNewsStand_eventPostBeginPlay_Parms
{
};

// Function TgGame.TgNewsStand.RegisterNewsChannel
// [0x00020400] ( FUNC_Native )
struct ATgNewsStand_execRegisterNewsChannel_Parms
{
};

// Function TgGame.TgObject.GetHealTargetColor
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UTgObject_execGetHealTargetColor_Parms
{
