/*
#############################################################################################
# Global Agenda (1.5.1.5) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TgGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_AI_MV_PATROL                                       8
#define CONST_AI_MV_PATROL_SHORT_STOP                            1156
#define CONST_AI_MV_PATROL_LONG_STOP                             1157
#define CONST_AI_MV_WANDER                                       11
#define CONST_AI_MV_FOLLOW                                       15
#define CONST_AI_MV_FOLLOW_AT_GUN_RANGE                          233
#define CONST_AI_MV_FOLLOW_AT_MELEE_RANGE                        257
#define CONST_AI_MV_LOCATION                                     238

/*enum TG_WIDGET_SUBTYPES
{
	IST_NONE                                           = 0,
	IST_DEVICE_MELEE                                   = 1,
	IST_DEVICE_RANGED                                  = 2,
	IST_DEVICE_SPECIALTY                               = 3,
	IST_DEVICE_JETPACK                                 = 4,
	IST_DEVICE_OFFHAND                                 = 5,
	IST_DEVICE_OFFHAND01                               = 6,
	IST_DEVICE_OFFHAND02                               = 7,
	IST_DEVICE_MORALE                                  = 8,
	IST_DEVICE_PICKUP                                  = 9,
	IST_DEVICE_CONSUMABLE                              = 10,
	IST_DEVICE_REST                                    = 11,
	IST_ARMOR_HEAD                                     = 12,
	IST_ARMOR_SHOULDER                                 = 13,
	IST_ARMOR_CHEST                                    = 14,
	IST_ARMOR_ARM                                      = 15,
	IST_ARMOR_HAND                                     = 16,
	IST_ARMOR_LEG                                      = 17,
	IST_ARMOR_FEET                                     = 18,
	IST_FLAIR_HELMET                                   = 19,
	IST_FLAIR_SUIT                                     = 20,
	IST_DYE_PRIMARY                                    = 21,
	IST_DYE_SECONDARY                                  = 22,
	IST_DYE_EMISSIVE                                   = 23,
	IST_DYE_WEAPON_PRIMARY                             = 24,
	IST_DYE_WEAPON_EMISSIVE                            = 25,
	IST_DYE_JETPACK_TRAIL                              = 26,
	IST_MAX                                            = 27
};*/

// Enum TgGame.TgUIInvWidget.TimedParamType
/*enum TimedParamType
{
	PT_AVAILABLE_FLASH                                 = 0,
	PT_USE_HIGHLIGHT                                   = 1,
	PT_COOLDOWN_SWOOP                                  = 2,
	PT_MAX                                             = 3
};*/

// Enum TgGame.TgUIMapWidget.EZoneMapStructType
/*enum EZoneMapStructType
{
	ZMST_None                                          = 0,
	ZMST_Objective                                     = 1,
	ZMST_Player                                        = 2,
	ZMST_Volume                                        = 3,
	ZMST_QuestVolume                                   = 4,
	ZMST_QuestPOI                                      = 5,
	ZMST_Portal                                        = 6,
	ZMST_MAX                                           = 7
};*/

// Enum TgGame.TgWindManager.TG_WIND_TYPE
/*enum TG_WIND_TYPE
{
	TG_WIND_Directional                                = 0,
	TG_WIND_Radial                                     = 1,
	TG_WIND_MAX                                        = 2
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TgGame.TgAnimNodeBlendByVerticalAim
// 0x003B (0x011C - 0x00E1)
class UTgAnimNodeBlendByVerticalAim : public UAnimNodeBlendBase
{
public:
	float                                              m_Aim;                                            		// 0x00E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   m_Range;                                          		// 0x00E8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_AngleOffset;                                    		// 0x00F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_PreviousAim;                                    		// 0x00F4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bInitialized : 1;                                 		// 0x00F8 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      m_bLoopChildrenOnRelevant : 1;                    		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bPlayChildrenOnRelevant : 1;                    		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	struct FName                                       m_AnimName_Up;                                    		// 0x00FC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_AnimName_Center;                                		// 0x0104 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_AnimName_Down;                                  		// 0x010C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeSequence*                           m_SeqNode1;                                       		// 0x0114 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UAnimNodeSequence*                           m_SeqNode2;                                       		// 0x0118 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1192 ];

		return pClassPointer;
	};

	void eventOnBecomeRelevant ( );
	void PlayAnim ( unsigned long bLoop, float Rate, float StartTime );
};

UClass* UTgAnimNodeBlendByVerticalAim::pClassPointer = NULL;

// Class TgGame.TgAnimNodeSequence
// 0x000A (0x0128 - 0x011E)
class UTgAnimNodeSequence : public UAnimNodeSequence
{
public:
	unsigned long                                      bAutoStart : 1;                                   		// 0x0120 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bResetOnActivate : 1;                             		// 0x0120 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      HasDynamicLength : 1;                             		// 0x0120 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      EnableFootControlsOnCease : 1;                    		// 0x0120 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	float                                              ChainedSequenceDuration;                          		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1193 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNodeSequence::pClassPointer = NULL;

// Class TgGame.TgAnimNotify_DeployOffhand
// 0x0000 (0x003C - 0x003C)
class UTgAnimNotify_DeployOffhand : public UAnimNotify
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1194 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNotify_DeployOffhand::pClassPointer = NULL;

// Class TgGame.TgAnimNotify_FootSkelControl
// 0x0008 (0x0044 - 0x003C)
class UTgAnimNotify_FootSkelControl : public UAnimNotify
{
public:
	int                                                c_Foot;                                           		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      c_bDisable : 1;                                   		// 0x0040 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1195 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNotify_FootSkelControl::pClassPointer = NULL;

// Class TgGame.TgAnimNotify_MeleeDamage
// 0x0005 (0x0041 - 0x003C)
class UTgAnimNotify_MeleeDamage : public UAnimNotify
{
public:
	float                                              m_Impulse;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_AttackDirection;                                		// 0x0040 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1196 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNotify_MeleeDamage::pClassPointer = NULL;

// Class TgGame.TgAnimNotify_PawnCanRefire
// 0x0004 (0x0040 - 0x003C)
class UTgAnimNotify_PawnCanRefire : public UAnimNotify
{
public:
	unsigned long                                      m_bForceLeftAttack : 1;                           		// 0x003C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1197 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNotify_PawnCanRefire::pClassPointer = NULL;

// Class TgGame.TgAnimNotify_SwapDevice
// 0x0000 (0x003C - 0x003C)
class UTgAnimNotify_SwapDevice : public UAnimNotify
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1198 ];

		return pClassPointer;
	};

};

UClass* UTgAnimNotify_SwapDevice::pClassPointer = NULL;

// Class TgGame.TgCaptureComponent
// 0x0010 (0x0130 - 0x0120)
class UTgCaptureComponent : public USceneCapture2DComponent
{
public:
	struct FQWord                                      m_qwShowFlags;                                    		// 0x0120 (0x0008) [0x0000000000000000]              
	unsigned long                                      m_bNeedsFullUpdate : 1;                           		// 0x0128 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FPointer                                    m_CaptureInfo;                                    		// 0x012C (0x0004) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1199 ];

		return pClassPointer;
	};

	void ForceFullUpdate ( );
};

UClass* UTgCaptureComponent::pClassPointer = NULL;

// Class TgGame.TgCharacterBuilderLight
// 0x0000 (0x01D4 - 0x01D4)
class ATgCharacterBuilderLight : public ASpotLightToggleable
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1200 ];

		return pClassPointer;
	};

};

UClass* ATgCharacterBuilderLight::pClassPointer = NULL;

// Class TgGame.TgChestActor
// 0x004C (0x0218 - 0x01CC)
class ATgChestActor : public AActor
{
public:
	struct FString                                     m_sAssemblyName;                                  		// 0x01CC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      m_bMeshLoaded : 1;                                		// 0x01D8 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      m_bSpawnOnLevelLoad : 1;                          		// 0x01D8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bAutoSpawn : 1;                                 		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000004] 
	class UTgSkeletalMeshComponent*                    m_Mesh;                                           		// 0x01DC (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x01E0 (0x0004) [0x00000000040A000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	int                                                m_nUseMsgId;                                      		// 0x01E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nLootTableId;                                   		// 0x01E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_MinRespawnTime;                                 		// 0x01EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_MaxRespawnTime;                                 		// 0x01F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      r_eChestState;                                    		// 0x01F4 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      c_eCurrentChestState;                             		// 0x01F5 (0x0001) [0x0000000000000000]              
	int                                                m_nTimeTakeToClose;                               		// 0x01F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nUseProxySize;                                  		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ATgPawn*                                     m_LastUsePawn;                                    		// 0x0200 (0x0004) [0x0000000000000000]              
	class UCylinderComponent*                          CylinderComponent;                                		// 0x0204 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class ATgCollisionProxy*                           m_CollisionProxy;                                 		// 0x0208 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UAnimNodeSequence*                           m_AnimNode;                                       		// 0x020C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              AlwaysRelevantDistanceSquared;                    		// 0x0210 (0x0004) [0x0000000000000000]              
	int                                                m_nPlayerTakeforceNumber;                         		// 0x0214 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1201 ];

		return pClassPointer;
	};

	void eventShowMesh ( );
	void eventHideMesh ( );
	void AdjustClientChestState ( );
	void RemoveUserPrompt ( );
	void eventReplicatedEvent ( struct FName VarName );
	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
	void DisplayUseMessage ( class ATgPawn* aPawn, unsigned long bDisplay );
	void OnToggle ( class USeqAct_Toggle* Action );
	void PostBeginPlay ( );
	void ForceNetRelevant ( );
	void CloseChest ( );
	void LootChest ( );
	void OpenChest ( class ATgPawn* aPawn );
	void RespawnChest ( );
	void SpawnChest ( );
	void LoadMesh ( );
};

UClass* ATgChestActor::pClassPointer = NULL;

// Class TgGame.TgCollisionProxy
// 0x0010 (0x01DC - 0x01CC)
class ATgCollisionProxy : public AActor
{
public:
	TArray< class ATgPawn* >                           m_NearByPlayers;                                  		// 0x01CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      m_bIgnoreStealthPlayers : 1;                      		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bIgnoreNonPlayers : 1;                          		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bIgnoreHackedPawns : 1;                         		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bIgnoreInvulnerablePlayers : 1;                 		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bForwardOwnerOnly : 1;                          		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000010] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1202 ];

		return pClassPointer;
	};

	void GetNearByPlayersTaskforce ( unsigned long bEndWhenMultipleFound, TArray< int >* NearByPlayerTaskForces );
	int GetNearByPlayers ( unsigned long bOnlyValid );
	void OnPlayerRemoved ( class ATgPawn* aPawn );
	void OnPlayerAdded ( class ATgPawn* aPawn );
	void CheckNearByPlayers ( class ATgPawn* aPawn, unsigned long bAdd );
	void ForceClearNearByPlayersList ( );
	bool eventShouldIgnoreActor ( class ATgPawn* aPawn );
	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

UClass* ATgCollisionProxy::pClassPointer = NULL;

// Class TgGame.TgCollisionProxy_Vortex
// 0x0020 (0x01FC - 0x01DC)
class ATgCollisionProxy_Vortex : public ATgCollisionProxy
{
public:
	float                                              m_fGroundSpeedStrafePct;                          		// 0x01DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fGroundSpeedToVortex;                           		// 0x01E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fGroundSpeedAdditive;                           		// 0x01E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fAirSpeed;                                      		// 0x01E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fFlySpeedToVortex;                              		// 0x01EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fFlySpeedToAdditive;                            		// 0x01F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fInnerRadius;                                   		// 0x01F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bEnabled : 1;                                   		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bOnlyAffectCurrentTarget : 1;                   		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1203 ];

		return pClassPointer;
	};

	void OnPlayerRemoved ( class ATgPawn* aPawn );
	void OnPlayerAdded ( class ATgPawn* aPawn );
	bool eventShouldIgnoreActor ( class ATgPawn* aPawn );
	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

UClass* ATgCollisionProxy_Vortex::pClassPointer = NULL;

// Class TgGame.TgDamageType
// 0x0054 (0x00E0 - 0x008C)
class UTgDamageType : public UDamageType
{
public:
	unsigned long                                      m_bImpulseMesh : 1;                               		// 0x008C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bRagdollOnDeathAnimEnd : 1;                     		// 0x008C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bEnableDirectionalDeathAnims : 1;               		// 0x008C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bPoke : 1;                                      		// 0x008C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bShowDamageFromInstigator : 1;                  		// 0x008C (0x0004) [0x0000000000000000] [0x00000010] 
	float                                              m_bMinImpulse;                                    		// 0x0090 (0x0004) [0x0000000000000000]              
	float                                              m_bMaxImpulse;                                    		// 0x0094 (0x0004) [0x0000000000000000]              
	float                                              m_bMinUpKick;                                     		// 0x0098 (0x0004) [0x0000000000000000]              
	float                                              m_bMaxUpKick;                                     		// 0x009C (0x0004) [0x0000000000000000]              
	float                                              m_fChanceToPlayDeathAnim;                         		// 0x00A0 (0x0004) [0x0000000000000000]              
	float                                              m_fChanceToPlayWritheAnim;                        		// 0x00A4 (0x0004) [0x0000000000000000]              
	TArray< struct FDamageTypeAnimInfo >               m_DeathAnimHitFromFrontInfo;                      		// 0x00A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FDamageTypeAnimInfo >               m_DeathAnimHitFromBackInfo;                       		// 0x00B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FDamageTypeAnimInfo >               m_WritheAnimFaceUpInfo;                           		// 0x00C0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FDamageTypeAnimInfo >               m_WritheAnimFaceDownInfo;                         		// 0x00CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fRestSpeed;                                     		// 0x00D8 (0x0004) [0x0000000000000000]              
	float                                              m_fPokeIntensity;                                 		// 0x00DC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1204 ];

		return pClassPointer;
	};

};

UClass* UTgDamageType::pClassPointer = NULL;

// Class TgGame.TgDebug
// 0x0034 (0x0070 - 0x003C)
class UTgDebug : public UObject
{
public:
	struct FString                                     TgAccountName;                                    		// 0x003C (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	struct FString                                     TgAccountPassword;                                		// 0x0048 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	struct FString                                     TgSecondAccountName;                              		// 0x0054 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	struct FString                                     TgSecondAccountPassword;                          		// 0x0060 (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	unsigned long                                      AutomateLogin : 1;                                		// 0x006C (0x0004) [0x0000000000044000] [0x00000001] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      SaveAccountInfo : 1;                              		// 0x006C (0x0004) [0x0000000000044000] [0x00000002] ( CPF_Config | CPF_GlobalConfig )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1205 ];

		return pClassPointer;
	};

	void eventWriteLoginInfo ( struct FString NameString, struct FString Password );
};

UClass* UTgDebug::pClassPointer = NULL;

// Class TgGame.TgDecalActor_Logo
// 0x0000 (0x01E8 - 0x01E8)
class ATgDecalActor_Logo : public ADecalActor
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1206 ];

		return pClassPointer;
	};

};

UClass* ATgDecalActor_Logo::pClassPointer = NULL;

// Class TgGame.TgDistributionFloatSoundAttenuation
// 0x003C (0x008C - 0x0050)
class UTgDistributionFloatSoundAttenuation : public UDistributionFloat
{
public:
	unsigned char                                      AttenuationType;                                  		// 0x0050 (0x0001) [0x0000000000000000]              
	float                                              Attenuation_Sm_foley;                             		// 0x0054 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Lg_foley;                             		// 0x0058 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Melee_hit;                            		// 0x005C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Sm_gun;                               		// 0x0060 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Med_gun;                              		// 0x0064 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Lg_gun;                               		// 0x0068 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Sm_exp;                               		// 0x006C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Med_exp;                              		// 0x0070 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Attenuation_Lg_exp;                               		// 0x0074 (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FName                                       GroupName;                                        		// 0x0078 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FAttenuationGroup >                 AttenuationGroups;                                		// 0x0080 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1207 ];

		return pClassPointer;
	};

};

UClass* UTgDistributionFloatSoundAttenuation::pClassPointer = NULL;

// Class TgGame.TgDoor
// 0x00C0 (0x02C4 - 0x0204)
class ATgDoor : public ADynamicSMActor
{
public:
	int                                                nPriority;                                        		// 0x0204 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nPrevPriority;                                    		// 0x0208 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Position;                                         		// 0x020C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Seconds;                                          		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FDoorPart                                   DoorParts[ 0x3 ];                                 		// 0x0214 (0x0090) [0x0000000000080001]              ( CPF_Edit | CPF_Component )
	class ANavigationPoint*                            NavPoint;                                         		// 0x02A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                c_nDoorParam;                                     		// 0x02A8 (0x0004) [0x0000000000000000]              
	unsigned long                                      r_bOpen : 1;                                      		// 0x02AC (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      m_bInitialized : 1;                               		// 0x02AC (0x0004) [0x0000000000000000] [0x00000002] 
	TArray< class UMaterialInstanceConstant* >         DoorMICs;                                         		// 0x02B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USoundCue*                                   StartSound;                                       		// 0x02BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   EndSound;                                         		// 0x02C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1208 ];

		return pClassPointer;
	};

	void eventReplicatedEvent ( struct FName VarName );
	void eventUpdateState ( unsigned long bOpen );
	void OnToggle ( class USeqAct_Toggle* Action );
	void PostBeginPlay ( );
	void UpdateMICs ( );
	void BuildDoor ( );
};

UClass* ATgDoor::pClassPointer = NULL;

// Class TgGame.TgDrawSkydiveRadiusComponent
// 0x0000 (0x01DC - 0x01DC)
class UTgDrawSkydiveRadiusComponent : public UDrawSphereComponent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1209 ];

		return pClassPointer;
	};

};

UClass* UTgDrawSkydiveRadiusComponent::pClassPointer = NULL;

// Class TgGame.TgDynamicSMActor
// 0x002C (0x0230 - 0x0204)
class ATgDynamicSMActor : public ADynamicSMActor
{
public:
	struct FString                                     m_sAssembly;                                      		// 0x0204 (0x000C) [0x0000000000400021]              ( CPF_Edit | CPF_Net | CPF_NeedCtorLink )
	class ATgEffectManager*                            r_EffectManager;                                  		// 0x0210 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                r_nHealth;                                        		// 0x0214 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	unsigned long                                      m_bDisplayHealth : 1;                             		// 0x0218 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bDestroyed : 1;                                 		// 0x0218 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      c_bMeshLoaded : 1;                                		// 0x0218 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FName                                       m_nExplosion;                                     		// 0x021C (0x0008) [0x0000000000000000]              
	int                                                c_nMaxHealth;                                     		// 0x0224 (0x0004) [0x0000000000000000]              
	class UMeshComponent*                              m_DestroyedMesh;                                  		// 0x0228 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_fLifeAfterDeathSecs;                            		// 0x022C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1210 ];

		return pClassPointer;
	};

	bool CanApplyEffects ( );
	void Detach ( class AActor* Other );
	void Attach ( class AActor* Other );
	void HideMesh ( );
	void DrawHealth ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
	float GetSize ( );
	void ProcessEffect ( class UTgEffectGroup* Effect, unsigned long bRemove, class AActor* aInstigator, struct FImpactInfo Impact );
	void PlaySpecialFx ( struct FName nDisplayMode );
	void Destroyed ( );
	void DestroyIt ( unsigned long bSkipFx );
	void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void eventReplicatedEvent ( struct FName VarName );
	void PostBeginPlay ( );
	void eventTick ( float DeltaTime );
	void ForceNetRelevant ( );
	void SwapMeshToDestroyed ( );
	void LoadMesh ( );
};

UClass* ATgDynamicSMActor::pClassPointer = NULL;

// Class TgGame.TgDynamicDestructible
// 0x0008 (0x0238 - 0x0230)
class ATgDynamicDestructible : public ATgDynamicSMActor
{
public:
	int                                                r_nDestructibleId;                                		// 0x0230 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class ATgDestructibleFactory*                      r_pFactory;                                       		// 0x0234 (0x0004) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1211 ];

		return pClassPointer;
	};

	void eventReplicatedEvent ( struct FName VarName );
	void InitializeById ( int nDestructibleId );
};

UClass* ATgDynamicDestructible::pClassPointer = NULL;

// Class TgGame.TgEmitterSpawnable
// 0x0000 (0x01D4 - 0x01D4)
class ATgEmitterSpawnable : public AEmitter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1212 ];

		return pClassPointer;
	};

};

UClass* ATgEmitterSpawnable::pClassPointer = NULL;

// Class TgGame.TgFlagCaptureVolume
// 0x0006 (0x020E - 0x0208)
class ATgFlagCaptureVolume : public AVolume
{
public:
	int                                                m_nMapObjectId;                                   		// 0x0208 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	unsigned char                                      r_nTaskForce;                                     		// 0x020C (0x0001) [0x0000000000020020]              ( CPF_Net | CPF_EditConst )
	unsigned char                                      r_eCoalition;                                     		// 0x020D (0x0001) [0x0000000000020020]              ( CPF_Net | CPF_EditConst )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1213 ];

		return pClassPointer;
	};

	struct FVector GetDisplayLocation ( );
	bool CanCapture ( class APawn* Pawn );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
	void PreBeginPlay ( );
	void setupFlagCapVolume ( );
};

UClass* ATgFlagCaptureVolume::pClassPointer = NULL;

// Class TgGame.TgFracturedStaticMeshActor
// 0x0044 (0x0274 - 0x0230)
class ATgFracturedStaticMeshActor : public AFracturedStaticMeshActor
{
public:
	class ATgEffectManager*                            r_EffectManager;                                  		// 0x0230 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                r_TakeHitNotifier;                                		// 0x0234 (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FVector                                     r_vTakeHitLocation;                               		// 0x0238 (0x000C) [0x0000000000000020]              ( CPF_Net )
	struct FVector                                     r_vTakeHitMomentum;                               		// 0x0244 (0x000C) [0x0000000000000020]              ( CPF_Net )
	class UClass*                                      r_HitDamageType;                                  		// 0x0250 (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FTraceHitInfo                               r_HitInfo;                                        		// 0x0254 (0x001C) [0x0000000000080020]              ( CPF_Net | CPF_Component )
	float                                              r_DamageRadius;                                   		// 0x0270 (0x0004) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1214 ];

		return pClassPointer;
	};

	void ProcessEffect ( class UTgEffectGroup* Effect, unsigned long bRemove, class AActor* aInstigator, struct FImpactInfo Impact );
	void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	bool CanApplyEffects ( );
	void Destroyed ( );
	void PostBeginPlay ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ATgFracturedStaticMeshActor::pClassPointer = NULL;

// Class TgGame.TgHeightFog
// 0x0004 (0x01D0 - 0x01CC)
class ATgHeightFog : public AInfo
{
public:
	class UHeightFogComponent*                         FogComponent;                                     		// 0x01CC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1215 ];

		return pClassPointer;
	};

};

UClass* ATgHeightFog::pClassPointer = NULL;

// Class TgGame.TgHexLandMarkActor
// 0x0008 (0x01D4 - 0x01CC)
class ATgHexLandMarkActor : public AActor
{
public:
	int                                                r_nMeshAsmId;                                     		// 0x01CC (0x0004) [0x0000000000000020]              ( CPF_Net )
	class UTgStaticMeshComponent*                      c_Mesh;                                           		// 0x01D0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1216 ];

		return pClassPointer;
	};

	void HideMesh ( );
	void Destroyed ( );
	void eventReplicatedEvent ( struct FName VarName );
	void PostBeginPlay ( );
	void LoadMesh ( );
};

UClass* ATgHexLandMarkActor::pClassPointer = NULL;

// Class TgGame.TgHUD
// 0x0138 (0x059C - 0x0464)
class ATgHUD : public AHUD
{
public:
	class ATgPlayerController*                         m_PlayerOwner;                                    		// 0x0464 (0x0004) [0x0000000000000000]              
	class ATgPawn*                                     m_PawnOwner;                                      		// 0x0468 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  m_HudTexture;                                     		// 0x046C (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  m_OverheadTexture;                                		// 0x0470 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UFont*                                       m_OverheadFont;                                   		// 0x0474 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UFont*                                       m_OverheadFont2;                                  		// 0x0478 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTgSpecialFxLightManager*                    m_FxLightManager;                                 		// 0x047C (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bSettingsNeedRestart : 1;                       		// 0x0480 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bDisablePostRender : 1;                         		// 0x0480 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bDisableTick : 1;                               		// 0x0480 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bTrackedQuestComplete : 1;                      		// 0x0480 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_bNeedAllQuestPOI : 1;                           		// 0x0480 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FMultiMap_Mirror                            m_WorldUIVolumesByVVType;                         		// 0x0484 (0x003C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	struct FMultiMap_Mirror                            m_WorldUIVolumesByAmVolumeId;                     		// 0x04C0 (0x003C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	struct FMultiMap_Mirror                            m_WorldUIVolumesByQuestId;                        		// 0x04FC (0x003C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	struct FMultiMap_Mirror                            m_WorldUIPOIByQuestId;                            		// 0x0538 (0x003C) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	TArray< class ATgOmegaVolume* >                    m_WorldUISubZones;                                		// 0x0574 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FPointer                                    m_pAmTrackingQuest;                               		// 0x0580 (0x0004) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	TArray< class ATgPointOfInterest* >                m_AllQuestPOI;                                    		// 0x0584 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class ATgPointOfInterest* >                m_ActiveQuestPOI;                                 		// 0x0590 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1217 ];

		return pClassPointer;
	};

	void eventCheckLevelUnlocks ( unsigned long bIsTutorial );
	class UUIScene* eventOpenIntroScene ( float FadeTime, float TotalTime );
	void eventClearTriggeredSceneInfo ( );
	void eventSetTriggeredSceneInfo ( class AActor* triggeredActor );
	void UpdateScoreBoard ( unsigned long bPlayerVictor, unsigned long bTie );
	void eventShowEndRaidScreen ( unsigned long bAttackerWon );
	void ShowEndTrainingMissionScreen ( struct FTG_TRAINING_END_INFO endInfo );
	void ShowQuestEndMissionScene ( unsigned long MissionVictor, unsigned long PlayerVictor, unsigned long bTie );
	void ShowEndMissionScreen ( unsigned long MissionVictor, unsigned long PlayerVictor, unsigned long bTie );
	void OpenScoreboard ( );
	void ToggleDrawAllHUD ( );
	void ToggleDrawPawnHUD ( );
	void ForceUpdateDeviceBar ( int nActiveDeviceId );
	void UpdateReleaseTime ( float fReleaseTime );
	void ShowReleaseDialog ( unsigned long bShow, struct FDeathZoomInfo Info, float fReleaseTime, unsigned long bCanManuallyRelease );
	bool eventTriggerCloseTgUIScene ( class UUIScene* Scene );
	class UObject* GetTgUISceneDriver ( class UUIScene* Scene );
	class UUIScene* TriggerOpenTgUIScene ( class UUIScene* Scene );
	bool eventIsMissionScene ( class UUIScene* Scene );
	void HideWorldInteractionText ( );
	void ShowWorldInteractionTextById ( int nMsgId );
	void ShowWorldInteractionText ( struct FString sMsg );
	void HideProgressBar ( unsigned long bWorldInteractionBar );
	void StartProgressBar ( float fDuration, struct FString sLabel, unsigned long bWorldInteractionBar );
	void UpdateSelectedDevice ( class ATgDevice* Dev );
	bool UsePickupDevice ( );
	void UpdateDeployPointCount ( );
	void OpenDeployPointMenu ( );
	void SetReticuleVisibility ( unsigned long bCrossHairVisible, unsigned long bWeaponStatusVisible );
	void HideTaskForce ( );
	void ShowTaskForce ( );
	bool ShouldDrawPawnHUD ( );
	void PlayHitEffect ( float Damage, struct FVector HitDir );
	void AddNewDisplayMessage ( struct FString sMessage );
	void AddNewKilledTarget ( struct FString KilledName, struct FString KillerName, unsigned long KillerWasPlayer );
	void eventCloseGUIItems ( );
	void eventOpenGUIItems ( );
	void SetZoomScope ( struct FName ScopeName );
	void CancelActiveCombat ( );
	void DisplayActiveCombat ( int nStateParam );
	void CancelInBombRange ( );
	void DisplayInBombRange ( );
	void CancelBeingDetected ( );
	void DisplayBeingDetected ( int nStateParam );
	void CancelBeingTargeted ( );
	void DisplayBeingTargeted ( );
	void CancelBeingLocked ( );
	void DisplayBeingLocked ( );
	void CancelBodyUnderAttack ( );
	void DisplayBodyUnderAttack ( int Damage );
	void DisplayHit ( struct FVector HitDir, int Damage, class UClass* DamageType );
	void SetMouseTargetDrawScale ( float NewScale );
	unsigned char GetCurrTargetMode ( );
	class AActor* GetMouseHoverActor ( );
	struct FVector GetMouseHitNormal ( );
	struct FVector GetMouseHoverLocation ( );
	void SetShowRangeTargeter ( unsigned long bInAimingMode );
	bool CheckShouldSkipEndMission ( );
	void UpdateRangedTargeterState ( unsigned char eNewState );
	void ResubmitPopups ( );
	bool HideObjectiveNames ( );
	bool HideObjectives ( );
	bool HideEnemyTags ( );
	bool ShowCombatText ( );
	bool ShowDeployableHealthBars ( );
	void UpdateUITextBox ( unsigned char TextBoxBitfield, float Duration, int messageID );
	void UpdateUITimer ( unsigned char ClockStateBitfield, float TimerDuration );
	void ResetDeviceHudTimersUI ( int DeviceEqpPoint );
	void UpdateDeviceBarUIItems ( );
	void UpdateInHandDevicesUI ( class ATgDevice* pDevice );
	void UpdateHiddenDevicesUI ( );
	void UpdateMouseTargetMode ( unsigned char NewMode );
	void UseCrosshairForReticule ( struct FName CrosshairName );
	void UpdateModeEquipTimer ( int nIsActive, float fEquipTime );
	void TriggerDeviceRefresh ( );
	void UpdateDeviceSlotTimers ( int nDeviceInstanceId, int nDeviceMode, float fSetup, float fRecharge, float fElaspedCooldown );
};

UClass* ATgHUD::pClassPointer = NULL;

// Class TgGame.TgInterpActor
// 0x0028 (0x0258 - 0x0230)
class ATgInterpActor : public AInterpActor
{
public:
	struct FString                                     m_sAssembly;                                      		// 0x0230 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     r_sCurrState;                                     		// 0x023C (0x000C) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )
	struct FVector                                     m_vMovement;                                      		// 0x0248 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fSeconds;                                       		// 0x0254 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1218 ];

		return pClassPointer;
	};

	void PlaySpecialFx ( );
	void eventReplicatedEvent ( struct FName VarName );
	void OnTriggerInterpActor ( class UTgSeqAct_TriggerInterpActor* Action );
	void PostBeginPlay ( );
	void LoadMesh ( );
};

UClass* ATgInterpActor::pClassPointer = NULL;

// Class TgGame.TgKActorSpawnable
// 0x0000 (0x02B4 - 0x02B4)
class ATgKActorSpawnable : public AKActorSpawnable
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1219 ];

		return pClassPointer;
	};

};

UClass* ATgKActorSpawnable::pClassPointer = NULL;

// Class TgGame.TgKAsset_ClientSideSim
// 0x0064 (0x0240 - 0x01DC)
class ATgKAsset_ClientSideSim : public AKAsset
{
public:
	float                                              m_fDamageImpulse;                                 		// 0x01DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UArrowComponent*                             m_Arrow;                                          		// 0x01E0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USpriteComponent*                            m_ForceSprite;                                    		// 0x01E4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      m_bEnableWind : 1;                                		// 0x01E8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bEnableGusts : 1;                               		// 0x01E8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bAnimates : 1;                                    		// 0x01E8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	float                                              m_fWindForceMin;                                  		// 0x01EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fWindForceMax;                                  		// 0x01F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fWindForceStrength;                             		// 0x01F4 (0x0004) [0x0000000000000000]              
	float                                              m_fWindForceTargetStrength;                       		// 0x01F8 (0x0004) [0x0000000000000000]              
	float                                              m_fWindFrequency;                                 		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fWindForceRemainingTime;                        		// 0x0200 (0x0004) [0x0000000000000000]              
	struct FVector                                     m_vWindDirection;                                 		// 0x0204 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fForceDistance;                                 		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fForceZOffsetMultiplier;                        		// 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fGustActiveTime;                                		// 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   m_vTimeBetweenGusts;                              		// 0x021C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_fGustActiveRemainingTime;                       		// 0x0224 (0x0004) [0x0000000000000000]              
	float                                              m_fTimeTillNextGust;                              		// 0x0228 (0x0004) [0x0000000000000000]              
	class ATgWindManager*                              m_WindManager;                                    		// 0x022C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   m_WindFrequencyMultiplier;                        		// 0x0230 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   m_WindForceMultiplier;                            		// 0x0238 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1220 ];

		return pClassPointer;
	};

	void OnHit ( struct FVector HitLocation, struct FVector HitNormal, class AActor* SourceActor, struct FTraceHitInfo HitInfo );
};

UClass* ATgKAsset_ClientSideSim::pClassPointer = NULL;

// Class TgGame.TgKAssetSpawnable
// 0x0000 (0x01DC - 0x01DC)
class ATgKAssetSpawnable : public AKAssetSpawnable
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1221 ];

		return pClassPointer;
	};

};

UClass* ATgKAssetSpawnable::pClassPointer = NULL;

// Class TgGame.TgManifestGroup
// 0x002C (0x0068 - 0x003C)
class UTgManifestGroup : public UObject
{
public:
	TArray< struct FPointer >                          m_ItemLists;                                      		// 0x003C (0x000C) [0x0000000000101000]              ( CPF_Native )
	TArray< class UTgObjectReferencer* >               m_pObjectReferencers;                             		// 0x0048 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	class UObject*                                     m_OwningObject;                                   		// 0x0054 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bIsInCallback : 1;                              		// 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FScriptDelegate                             __OnAllManifestsLoaded__Delegate;                 		// 0x005C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1222 ];

		return pClassPointer;
	};

	void OnAllManifestsLoaded ( );
};

UClass* UTgManifestGroup::pClassPointer = NULL;

// Class TgGame.TgMeshAssembly
// 0x0014 (0x01E0 - 0x01CC)
class ATgMeshAssembly : public AActor
{
public:
	struct FString                                     m_sAssemblyName;                                  		// 0x01CC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      m_bMeshLoaded : 1;                                		// 0x01D8 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	class UTgStaticMeshComponent*                      m_Mesh;                                           		// 0x01DC (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1223 ];

		return pClassPointer;
	};

	void PostBeginPlay ( );
	void ForceNetRelevant ( );
	void LoadMesh ( );
};

UClass* ATgMeshAssembly::pClassPointer = NULL;

// Class TgGame.TgNewsStand
// 0x0000 (0x01CC - 0x01CC)
class ATgNewsStand : public AActor
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1224 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void eventPostBeginPlay ( );
	void RegisterNewsChannel ( );
};

UClass* ATgNewsStand::pClassPointer = NULL;

// Class TgGame.TgObject
// 0x0000 (0x003C - 0x003C)
class UTgObject : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1225 ];

		return pClassPointer;
	};

	struct FColor GetHealTargetColor ( );
	struct FColor GetTeamColor ( );
	struct FColor GetEnemyColor ( );
	struct FColor GetFriendlyColor ( );
	struct FColor GetPlayerColor ( );
	void eventStartFire ( );
	void eventSetTaskForceNumber ( );
	void eventInitializeDefaultProps ( );
	void eventSortDamageDisplay ( );
	void eventIsFriendlyWithLocalPawn ( );
};

UClass* UTgObject::pClassPointer = NULL;

// Class TgGame.TgObjectReferencer
// 0x0004 (0x004C - 0x0048)
class UTgObjectReferencer : public UObjectReferencer
{
public:
	struct FPointer                                    m_Manifest;                                       		// 0x0048 (0x0004) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1226 ];

		return pClassPointer;
	};

};

UClass* UTgObjectReferencer::pClassPointer = NULL;

// Class TgGame.TgPostProcessVolume
// 0x001C (0x02B0 - 0x0294)
class ATgPostProcessVolume : public APostProcessVolume
{
public:
	class UMaterialInterface*                          m_Material;                                       		// 0x0294 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_SceneDPG;                                       		// 0x0298 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInstanceConstant*                   m_MaterialMIC;                                    		// 0x029C (0x0004) [0x0000000000000000]              
	float                                              m_FadeInTime;                                     		// 0x02A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_FadeOutTime;                                    		// 0x02A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_FadeScalarParameterName;                        		// 0x02A8 (0x0008) [0x0000000000000001]              ( CPF_Edit )

